{
  "irVersion": "7",
  "producerName": "pytorch",
  "producerVersion": "1.10",
  "graph": {
    "node": [
      {
        "output": [
          "17"
        ],
        "name": "Constant_0",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "18"
        ],
        "name": "Constant_1",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "res.1",
          "17",
          "18"
        ],
        "output": [
          "19"
        ],
        "name": "QuantizeLinear_2",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "20"
        ],
        "name": "Constant_3",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "21"
        ],
        "name": "Constant_4",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "19",
          "20",
          "21"
        ],
        "output": [
          "22"
        ],
        "name": "DequantizeLinear_5",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "23"
        ],
        "name": "Constant_6",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "24"
        ],
        "name": "Constant_7",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.weight",
          "23",
          "24"
        ],
        "output": [
          "25"
        ],
        "name": "QuantizeLinear_8",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "26"
        ],
        "name": "Constant_9",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "27"
        ],
        "name": "Constant_10",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "25",
          "26",
          "27"
        ],
        "output": [
          "28"
        ],
        "name": "DequantizeLinear_11",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "29"
        ],
        "name": "Constant_12",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "30"
        ],
        "name": "Constant_13",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.bias",
          "29",
          "30"
        ],
        "output": [
          "31"
        ],
        "name": "QuantizeLinear_14",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "32"
        ],
        "name": "Constant_15",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "33"
        ],
        "name": "Constant_16",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "31",
          "32",
          "33"
        ],
        "output": [
          "34"
        ],
        "name": "DequantizeLinear_17",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "22",
          "28",
          "34"
        ],
        "output": [
          "35"
        ],
        "name": "Conv_18",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "11",
              "11"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "2",
              "2",
              "2",
              "2"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "4",
              "4"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "35"
        ],
        "output": [
          "36"
        ],
        "name": "Relu_19",
        "opType": "Relu"
      },
      {
        "output": [
          "37"
        ],
        "name": "Constant_20",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "38"
        ],
        "name": "Constant_21",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "36",
          "37",
          "38"
        ],
        "output": [
          "39"
        ],
        "name": "QuantizeLinear_22",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "40"
        ],
        "name": "Constant_23",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "41"
        ],
        "name": "Constant_24",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "39",
          "40",
          "41"
        ],
        "output": [
          "42"
        ],
        "name": "DequantizeLinear_25",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "42"
        ],
        "output": [
          "43"
        ],
        "name": "MaxPool_26",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "44"
        ],
        "name": "Constant_27",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "45"
        ],
        "name": "Constant_28",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "43",
          "44",
          "45"
        ],
        "output": [
          "46"
        ],
        "name": "QuantizeLinear_29",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "47"
        ],
        "name": "Constant_30",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "48"
        ],
        "name": "Constant_31",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "46",
          "47",
          "48"
        ],
        "output": [
          "49"
        ],
        "name": "DequantizeLinear_32",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "50"
        ],
        "name": "Constant_33",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "51"
        ],
        "name": "Constant_34",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_4.weight",
          "50",
          "51"
        ],
        "output": [
          "52"
        ],
        "name": "QuantizeLinear_35",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "53"
        ],
        "name": "Constant_36",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "54"
        ],
        "name": "Constant_37",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "52",
          "53",
          "54"
        ],
        "output": [
          "55"
        ],
        "name": "DequantizeLinear_38",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "56"
        ],
        "name": "Constant_39",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "57"
        ],
        "name": "Constant_40",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_4.bias",
          "56",
          "57"
        ],
        "output": [
          "58"
        ],
        "name": "QuantizeLinear_41",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "59"
        ],
        "name": "Constant_42",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "60"
        ],
        "name": "Constant_43",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "58",
          "59",
          "60"
        ],
        "output": [
          "61"
        ],
        "name": "DequantizeLinear_44",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "49",
          "55",
          "61"
        ],
        "output": [
          "62"
        ],
        "name": "Conv_45",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "5",
              "5"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "2",
              "2",
              "2",
              "2"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "62"
        ],
        "output": [
          "63"
        ],
        "name": "Relu_46",
        "opType": "Relu"
      },
      {
        "output": [
          "64"
        ],
        "name": "Constant_47",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "65"
        ],
        "name": "Constant_48",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "63",
          "64",
          "65"
        ],
        "output": [
          "66"
        ],
        "name": "QuantizeLinear_49",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "67"
        ],
        "name": "Constant_50",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "68"
        ],
        "name": "Constant_51",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "66",
          "67",
          "68"
        ],
        "output": [
          "69"
        ],
        "name": "DequantizeLinear_52",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "69"
        ],
        "output": [
          "70"
        ],
        "name": "MaxPool_53",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "71"
        ],
        "name": "Constant_54",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "72"
        ],
        "name": "Constant_55",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "70",
          "71",
          "72"
        ],
        "output": [
          "73"
        ],
        "name": "QuantizeLinear_56",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "74"
        ],
        "name": "Constant_57",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "75"
        ],
        "name": "Constant_58",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "73",
          "74",
          "75"
        ],
        "output": [
          "76"
        ],
        "name": "DequantizeLinear_59",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "77"
        ],
        "name": "Constant_60",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "78"
        ],
        "name": "Constant_61",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_7.weight",
          "77",
          "78"
        ],
        "output": [
          "79"
        ],
        "name": "QuantizeLinear_62",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "80"
        ],
        "name": "Constant_63",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "81"
        ],
        "name": "Constant_64",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "79",
          "80",
          "81"
        ],
        "output": [
          "82"
        ],
        "name": "DequantizeLinear_65",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "83"
        ],
        "name": "Constant_66",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "84"
        ],
        "name": "Constant_67",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_7.bias",
          "83",
          "84"
        ],
        "output": [
          "85"
        ],
        "name": "QuantizeLinear_68",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "86"
        ],
        "name": "Constant_69",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "87"
        ],
        "name": "Constant_70",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "85",
          "86",
          "87"
        ],
        "output": [
          "88"
        ],
        "name": "DequantizeLinear_71",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "76",
          "82",
          "88"
        ],
        "output": [
          "89"
        ],
        "name": "Conv_72",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "89"
        ],
        "output": [
          "90"
        ],
        "name": "Relu_73",
        "opType": "Relu"
      },
      {
        "output": [
          "91"
        ],
        "name": "Constant_74",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "92"
        ],
        "name": "Constant_75",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "90",
          "91",
          "92"
        ],
        "output": [
          "93"
        ],
        "name": "QuantizeLinear_76",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "94"
        ],
        "name": "Constant_77",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "95"
        ],
        "name": "Constant_78",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "93",
          "94",
          "95"
        ],
        "output": [
          "96"
        ],
        "name": "DequantizeLinear_79",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "97"
        ],
        "name": "Constant_80",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "98"
        ],
        "name": "Constant_81",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_9.weight",
          "97",
          "98"
        ],
        "output": [
          "99"
        ],
        "name": "QuantizeLinear_82",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "100"
        ],
        "name": "Constant_83",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "101"
        ],
        "name": "Constant_84",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "99",
          "100",
          "101"
        ],
        "output": [
          "102"
        ],
        "name": "DequantizeLinear_85",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "103"
        ],
        "name": "Constant_86",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "104"
        ],
        "name": "Constant_87",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_9.bias",
          "103",
          "104"
        ],
        "output": [
          "105"
        ],
        "name": "QuantizeLinear_88",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "106"
        ],
        "name": "Constant_89",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "107"
        ],
        "name": "Constant_90",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "105",
          "106",
          "107"
        ],
        "output": [
          "108"
        ],
        "name": "DequantizeLinear_91",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "96",
          "102",
          "108"
        ],
        "output": [
          "109"
        ],
        "name": "Conv_92",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "109"
        ],
        "output": [
          "110"
        ],
        "name": "Relu_93",
        "opType": "Relu"
      },
      {
        "output": [
          "111"
        ],
        "name": "Constant_94",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "112"
        ],
        "name": "Constant_95",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "110",
          "111",
          "112"
        ],
        "output": [
          "113"
        ],
        "name": "QuantizeLinear_96",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "114"
        ],
        "name": "Constant_97",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "115"
        ],
        "name": "Constant_98",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "113",
          "114",
          "115"
        ],
        "output": [
          "116"
        ],
        "name": "DequantizeLinear_99",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "117"
        ],
        "name": "Constant_100",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "118"
        ],
        "name": "Constant_101",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_11.weight",
          "117",
          "118"
        ],
        "output": [
          "119"
        ],
        "name": "QuantizeLinear_102",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "120"
        ],
        "name": "Constant_103",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "121"
        ],
        "name": "Constant_104",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "119",
          "120",
          "121"
        ],
        "output": [
          "122"
        ],
        "name": "DequantizeLinear_105",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "123"
        ],
        "name": "Constant_106",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "124"
        ],
        "name": "Constant_107",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_11.bias",
          "123",
          "124"
        ],
        "output": [
          "125"
        ],
        "name": "QuantizeLinear_108",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "126"
        ],
        "name": "Constant_109",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "127"
        ],
        "name": "Constant_110",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "125",
          "126",
          "127"
        ],
        "output": [
          "128"
        ],
        "name": "DequantizeLinear_111",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "116",
          "122",
          "128"
        ],
        "output": [
          "129"
        ],
        "name": "Conv_112",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "129"
        ],
        "output": [
          "130"
        ],
        "name": "Relu_113",
        "opType": "Relu"
      },
      {
        "output": [
          "131"
        ],
        "name": "Constant_114",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "132"
        ],
        "name": "Constant_115",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "130",
          "131",
          "132"
        ],
        "output": [
          "133"
        ],
        "name": "QuantizeLinear_116",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "134"
        ],
        "name": "Constant_117",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "135"
        ],
        "name": "Constant_118",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "133",
          "134",
          "135"
        ],
        "output": [
          "136"
        ],
        "name": "DequantizeLinear_119",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "136"
        ],
        "output": [
          "137"
        ],
        "name": "MaxPool_120",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "138"
        ],
        "name": "Constant_121",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "139"
        ],
        "name": "Constant_122",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "137",
          "138",
          "139"
        ],
        "output": [
          "140"
        ],
        "name": "QuantizeLinear_123",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "141"
        ],
        "name": "Constant_124",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "142"
        ],
        "name": "Constant_125",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "140",
          "141",
          "142"
        ],
        "output": [
          "143"
        ],
        "name": "DequantizeLinear_126",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "144"
        ],
        "name": "Constant_127",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "143",
          "144"
        ],
        "output": [
          "145"
        ],
        "name": "Pad_128",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          }
        ]
      },
      {
        "input": [
          "145"
        ],
        "output": [
          "146"
        ],
        "name": "AveragePool_129",
        "opType": "AveragePool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "147"
        ],
        "name": "Constant_130",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "146",
          "147"
        ],
        "output": [
          "148"
        ],
        "name": "Mul_131",
        "opType": "Mul"
      },
      {
        "output": [
          "149"
        ],
        "name": "Constant_132",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "150"
        ],
        "name": "Constant_133",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "148",
          "149",
          "150"
        ],
        "output": [
          "151"
        ],
        "name": "QuantizeLinear_134",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "152"
        ],
        "name": "Constant_135",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "153"
        ],
        "name": "Constant_136",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "151",
          "152",
          "153"
        ],
        "output": [
          "154"
        ],
        "name": "DequantizeLinear_137",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "154"
        ],
        "output": [
          "155"
        ],
        "name": "Flatten_138",
        "opType": "Flatten",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "156"
        ],
        "name": "Constant_139",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "157"
        ],
        "name": "Constant_140",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_16.weight",
          "156",
          "157"
        ],
        "output": [
          "158"
        ],
        "name": "QuantizeLinear_141",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "159"
        ],
        "name": "Constant_142",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "160"
        ],
        "name": "Constant_143",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "158",
          "159",
          "160"
        ],
        "output": [
          "161"
        ],
        "name": "DequantizeLinear_144",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "162"
        ],
        "name": "Constant_145",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "163"
        ],
        "name": "Constant_146",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_16.bias",
          "162",
          "163"
        ],
        "output": [
          "164"
        ],
        "name": "QuantizeLinear_147",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "165"
        ],
        "name": "Constant_148",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "166"
        ],
        "name": "Constant_149",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "164",
          "165",
          "166"
        ],
        "output": [
          "167"
        ],
        "name": "DequantizeLinear_150",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "155",
          "161",
          "167"
        ],
        "output": [
          "168"
        ],
        "name": "Gemm_151",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "168"
        ],
        "output": [
          "169"
        ],
        "name": "Relu_152",
        "opType": "Relu"
      },
      {
        "output": [
          "170"
        ],
        "name": "Constant_153",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "171"
        ],
        "name": "Constant_154",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "169",
          "170",
          "171"
        ],
        "output": [
          "172"
        ],
        "name": "QuantizeLinear_155",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "173"
        ],
        "name": "Constant_156",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "174"
        ],
        "name": "Constant_157",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "172",
          "173",
          "174"
        ],
        "output": [
          "175"
        ],
        "name": "DequantizeLinear_158",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "176"
        ],
        "name": "Constant_159",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "177"
        ],
        "name": "Constant_160",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_18.weight",
          "176",
          "177"
        ],
        "output": [
          "178"
        ],
        "name": "QuantizeLinear_161",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "179"
        ],
        "name": "Constant_162",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "180"
        ],
        "name": "Constant_163",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "178",
          "179",
          "180"
        ],
        "output": [
          "181"
        ],
        "name": "DequantizeLinear_164",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "182"
        ],
        "name": "Constant_165",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "183"
        ],
        "name": "Constant_166",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_18.bias",
          "182",
          "183"
        ],
        "output": [
          "184"
        ],
        "name": "QuantizeLinear_167",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "185"
        ],
        "name": "Constant_168",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "186"
        ],
        "name": "Constant_169",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "184",
          "185",
          "186"
        ],
        "output": [
          "187"
        ],
        "name": "DequantizeLinear_170",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "175",
          "181",
          "187"
        ],
        "output": [
          "188"
        ],
        "name": "Gemm_171",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "188"
        ],
        "output": [
          "189"
        ],
        "name": "Relu_172",
        "opType": "Relu"
      },
      {
        "output": [
          "190"
        ],
        "name": "Constant_173",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "191"
        ],
        "name": "Constant_174",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "189",
          "190",
          "191"
        ],
