{
  "irVersion": "7",
  "producerName": "pytorch",
  "producerVersion": "1.10",
  "graph": {
    "node": [
      {
        "output": [
          "165"
        ],
        "name": "Constant_0",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "166"
        ],
        "name": "Constant_1",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "res.1",
          "165",
          "166"
        ],
        "output": [
          "167"
        ],
        "name": "QuantizeLinear_2",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "168"
        ],
        "name": "Constant_3",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "169"
        ],
        "name": "Constant_4",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "167",
          "168",
          "169"
        ],
        "output": [
          "170"
        ],
        "name": "DequantizeLinear_5",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "171"
        ],
        "name": "Constant_6",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "172"
        ],
        "name": "Constant_7",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.weight",
          "171",
          "172"
        ],
        "output": [
          "173"
        ],
        "name": "QuantizeLinear_8",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "174"
        ],
        "name": "Constant_9",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "175"
        ],
        "name": "Constant_10",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "173",
          "174",
          "175"
        ],
        "output": [
          "176"
        ],
        "name": "DequantizeLinear_11",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "177"
        ],
        "name": "Constant_12",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "178"
        ],
        "name": "Constant_13",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.bias",
          "177",
          "178"
        ],
        "output": [
          "179"
        ],
        "name": "QuantizeLinear_14",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "180"
        ],
        "name": "Constant_15",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "181"
        ],
        "name": "Constant_16",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "179",
          "180",
          "181"
        ],
        "output": [
          "182"
        ],
        "name": "DequantizeLinear_17",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "170",
          "176",
          "182"
        ],
        "output": [
          "183"
        ],
        "name": "Conv_18",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "184"
        ],
        "name": "Constant_19",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "185"
        ],
        "name": "Constant_20",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "183",
          "184",
          "185"
        ],
        "output": [
          "186"
        ],
        "name": "QuantizeLinear_21",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "187"
        ],
        "name": "Constant_22",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "188"
        ],
        "name": "Constant_23",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "186",
          "187",
          "188"
        ],
        "output": [
          "189"
        ],
        "name": "DequantizeLinear_24",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "189"
        ],
        "output": [
          "190"
        ],
        "name": "Sigmoid_25",
        "opType": "Sigmoid"
      },
      {
        "input": [
          "189",
          "190"
        ],
        "output": [
          "191"
        ],
        "name": "Mul_26",
        "opType": "Mul"
      },
      {
        "output": [
          "192"
        ],
        "name": "Constant_27",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "193"
        ],
        "name": "Constant_28",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "191",
          "192",
          "193"
        ],
        "output": [
          "194"
        ],
        "name": "QuantizeLinear_29",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "195"
        ],
        "name": "Constant_30",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "196"
        ],
        "name": "Constant_31",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "194",
          "195",
          "196"
        ],
        "output": [
          "197"
        ],
        "name": "DequantizeLinear_32",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "198"
        ],
        "name": "Constant_33",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "199"
        ],
        "name": "Constant_34",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_3.weight",
          "198",
          "199"
        ],
        "output": [
          "200"
        ],
        "name": "QuantizeLinear_35",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "201"
        ],
        "name": "Constant_36",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "202"
        ],
        "name": "Constant_37",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "200",
          "201",
          "202"
        ],
        "output": [
          "203"
        ],
        "name": "DequantizeLinear_38",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "204"
        ],
        "name": "Constant_39",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "205"
        ],
        "name": "Constant_40",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_3.bias",
          "204",
          "205"
        ],
        "output": [
          "206"
        ],
        "name": "QuantizeLinear_41",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "207"
        ],
        "name": "Constant_42",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "208"
        ],
        "name": "Constant_43",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "206",
          "207",
          "208"
        ],
        "output": [
          "209"
        ],
        "name": "DequantizeLinear_44",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "197",
          "203",
          "209"
        ],
        "output": [
          "210"
        ],
        "name": "Conv_45",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "32",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "211"
        ],
        "name": "Constant_46",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "212"
        ],
        "name": "Constant_47",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "210",
          "211",
          "212"
        ],
        "output": [
          "213"
        ],
        "name": "QuantizeLinear_48",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "214"
        ],
        "name": "Constant_49",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "215"
        ],
        "name": "Constant_50",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "213",
          "214",
          "215"
        ],
        "output": [
          "216"
        ],
        "name": "DequantizeLinear_51",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "216"
        ],
        "output": [
          "217"
        ],
        "name": "Sigmoid_52",
        "opType": "Sigmoid"
      },
      {
        "input": [
          "216",
          "217"
        ],
        "output": [
          "218"
        ],
        "name": "Mul_53",
        "opType": "Mul"
      },
      {
        "output": [
          "219"
        ],
        "name": "Constant_54",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "220"
        ],
        "name": "Constant_55",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "218",
          "219",
          "220"
        ],
        "output": [
          "221"
        ],
        "name": "QuantizeLinear_56",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "222"
        ],
        "name": "Constant_57",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "223"
        ],
        "name": "Constant_58",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "221",
          "222",
          "223"
        ],
        "output": [
          "224"
        ],
        "name": "DequantizeLinear_59",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "224"
        ],
        "output": [
          "225"
        ],
        "name": "GlobalAveragePool_60",
        "opType": "GlobalAveragePool"
      },
      {
        "output": [
          "226"
        ],
        "name": "Constant_61",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "225",
          "226"
        ],
        "output": [
          "227"
        ],
        "name": "Mul_62",
        "opType": "Mul"
      },
      {
        "output": [
          "228"
        ],
        "name": "Constant_63",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "229"
        ],
        "name": "Constant_64",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "227",
          "228",
          "229"
        ],
        "output": [
          "230"
        ],
        "name": "QuantizeLinear_65",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "231"
        ],
        "name": "Constant_66",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "232"
        ],
        "name": "Constant_67",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "230",
          "231",
          "232"
        ],
        "output": [
          "233"
        ],
        "name": "DequantizeLinear_68",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "234"
        ],
        "name": "Constant_69",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "235"
        ],
        "name": "Constant_70",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_6.weight",
          "234",
          "235"
        ],
        "output": [
          "236"
        ],
        "name": "QuantizeLinear_71",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "237"
        ],
        "name": "Constant_72",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "238"
        ],
        "name": "Constant_73",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "236",
          "237",
          "238"
        ],
        "output": [
          "239"
        ],
        "name": "DequantizeLinear_74",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "240"
        ],
        "name": "Constant_75",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "241"
        ],
        "name": "Constant_76",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_6.bias",
          "240",
          "241"
        ],
        "output": [
          "242"
        ],
        "name": "QuantizeLinear_77",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "243"
        ],
        "name": "Constant_78",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "244"
        ],
        "name": "Constant_79",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "242",
          "243",
          "244"
        ],
        "output": [
          "245"
        ],
        "name": "DequantizeLinear_80",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "233",
          "239",
          "245"
        ],
        "output": [
          "246"
        ],
        "name": "Conv_81",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "247"
        ],
        "name": "Constant_82",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "248"
        ],
        "name": "Constant_83",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "246",
          "247",
          "248"
        ],
        "output": [
          "249"
        ],
        "name": "QuantizeLinear_84",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "250"
        ],
        "name": "Constant_85",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "251"
        ],
        "name": "Constant_86",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "249",
          "250",
          "251"
        ],
        "output": [
          "252"
        ],
        "name": "DequantizeLinear_87",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "252"
        ],
        "output": [
          "253"
        ],
        "name": "Sigmoid_88",
        "opType": "Sigmoid"
      },
      {
        "input": [
          "252",
          "253"
        ],
        "output": [
          "254"
        ],
        "name": "Mul_89",
        "opType": "Mul"
      },
      {
        "output": [
          "255"
        ],
        "name": "Constant_90",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "256"
        ],
        "name": "Constant_91",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "254",
          "255",
          "256"
        ],
        "output": [
          "257"
        ],
        "name": "QuantizeLinear_92",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "258"
        ],
        "name": "Constant_93",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "259"
        ],
        "name": "Constant_94",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "257",
          "258",
          "259"
        ],
        "output": [
          "260"
        ],
        "name": "DequantizeLinear_95",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "261"
        ],
        "name": "Constant_96",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "262"
        ],
        "name": "Constant_97",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_8.weight",
          "261",
          "262"
        ],
        "output": [
          "263"
        ],
        "name": "QuantizeLinear_98",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "264"
        ],
        "name": "Constant_99",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "265"
        ],
        "name": "Constant_100",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "263",
          "264",
          "265"
        ],
        "output": [
          "266"
        ],
        "name": "DequantizeLinear_101",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "267"
        ],
        "name": "Constant_102",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "268"
        ],
        "name": "Constant_103",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_8.bias",
          "267",
          "268"
        ],
        "output": [
          "269"
        ],
        "name": "QuantizeLinear_104",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "270"
        ],
        "name": "Constant_105",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "271"
        ],
        "name": "Constant_106",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "269",
          "270",
          "271"
        ],
        "output": [
          "272"
        ],
        "name": "DequantizeLinear_107",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "260",
          "266",
          "272"
        ],
        "output": [
          "273"
        ],
        "name": "Conv_108",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "274"
        ],
        "name": "Constant_109",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "275"
        ],
        "name": "Constant_110",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "273",
          "274",
          "275"
        ],
        "output": [
          "276"
        ],
        "name": "QuantizeLinear_111",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "277"
        ],
        "name": "Constant_112",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "278"
        ],
        "name": "Constant_113",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "276",
          "277",
          "278"
        ],
        "output": [
          "279"
        ],
        "name": "DequantizeLinear_114",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "279"
        ],
        "output": [
          "280"
        ],
        "name": "Sigmoid_115",
        "opType": "Sigmoid"
      },
      {
        "output": [
          "281"
        ],
        "name": "Constant_116",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "282"
        ],
        "name": "Constant_117",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "280",
          "281",
          "282"
        ],
        "output": [
          "283"
        ],
        "name": "QuantizeLinear_118",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "284"
        ],
        "name": "Constant_119",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "285"
        ],
        "name": "Constant_120",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "283",
          "284",
          "285"
        ],
        "output": [
          "286"
        ],
        "name": "DequantizeLinear_121",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "286",
          "224"
        ],
        "output": [
          "287"
        ],
        "name": "Mul_122",
        "opType": "Mul"
      },
      {
        "output": [
          "288"
        ],
        "name": "Constant_123",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "289"
        ],
        "name": "Constant_124",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "287",
          "288",
          "289"
        ],
        "output": [
          "290"
        ],
        "name": "QuantizeLinear_125",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "291"
        ],
        "name": "Constant_126",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "292"
        ],
        "name": "Constant_127",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "290",
          "291",
          "292"
        ],
        "output": [
          "293"
        ],
        "name": "DequantizeLinear_128",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "294"
        ],
        "name": "Constant_129",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "295"
        ],
        "name": "Constant_130",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_11.weight",
          "294",
          "295"
        ],
        "output": [
          "296"
        ],
        "name": "QuantizeLinear_131",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "297"
        ],
        "name": "Constant_132",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "298"
        ],
        "name": "Constant_133",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "296",
          "297",
          "298"
        ],
        "output": [
          "299"
        ],
        "name": "DequantizeLinear_134",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "300"
        ],
        "name": "Constant_135",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "301"
        ],
        "name": "Constant_136",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_11.bias",
          "300",
          "301"
        ],
        "output": [
          "302"
        ],
        "name": "QuantizeLinear_137",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "303"
        ],
        "name": "Constant_138",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "304"
        ],
        "name": "Constant_139",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "302",
          "303",
          "304"
        ],
        "output": [
          "305"
        ],
        "name": "DequantizeLinear_140",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "293",
          "299",
          "305"
        ],
        "output": [
          "306"
        ],
        "name": "Conv_141",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "307"
        ],
        "name": "Constant_142",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "308"
        ],
        "name": "Constant_143",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "306",
          "307",
          "308"
        ],
        "output": [
          "309"
        ],
        "name": "QuantizeLinear_144",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "310"
        ],
        "name": "Constant_145",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "311"
        ],
        "name": "Constant_146",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "309",
          "310",
          "311"
        ],
        "output": [
          "312"
        ],
        "name": "DequantizeLinear_147",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "313"
        ],
        "name": "Constant_148",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "314"
        ],
        "name": "Constant_149",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_12.weight",
          "313",
          "314"
        ],
        "output": [
          "315"
        ],
        "name": "QuantizeLinear_150",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "316"
        ],
        "name": "Constant_151",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "317"
        ],
        "name": "Constant_152",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "315",
          "316",
          "317"
        ],
        "output": [
          "318"
        ],
        "name": "DequantizeLinear_153",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "319"
        ],
        "name": "Constant_154",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "320"
        ],
        "name": "Constant_155",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_12.bias",
          "319",
          "320"
        ],
        "output": [
          "321"
        ],
        "name": "QuantizeLinear_156",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "322"
        ],
        "name": "Constant_157",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "323"
        ],
        "name": "Constant_158",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "321",
          "322",
          "323"
        ],
        "output": [
          "324"
        ],
        "name": "DequantizeLinear_159",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "312",
          "318",
          "324"
        ],
        "output": [
          "325"
        ],
        "name": "Conv_160",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "326"
        ],
        "name": "Constant_161",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "327"
        ],
        "name": "Constant_162",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "325",
          "326",
          "327"
        ],
        "output": [
          "328"
        ],
        "name": "QuantizeLinear_163",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "329"
        ],
        "name": "Constant_164",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "330"
        ],
        "name": "Constant_165",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "328",
          "329",
          "330"
        ],
        "output": [
          "331"
        ],
        "name": "DequantizeLinear_166",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "331"
        ],
        "output": [
          "332"
        ],
        "name": "Sigmoid_167",
        "opType": "Sigmoid"
      },
      {
        "input": [
          "331",
          "332"
        ],
        "output": [
          "333"
        ],
        "name": "Mul_168",
        "opType": "Mul"
      },
      {
        "output": [
          "334"
        ],
        "name": "Constant_169",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "335"
        ],
        "name": "Constant_170",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "333",
          "334",
          "335"
        ],
        "output": [
          "336"
        ],
        "name": "QuantizeLinear_171",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "337"
        ],
        "name": "Constant_172",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "338"
        ],
        "name": "Constant_173",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "336",
          "337",
          "338"
        ],
        "output": [
          "339"
        ],
        "name": "DequantizeLinear_174",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "340"
        ],
        "name": "Constant_175",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "341"
        ],
        "name": "Constant_176",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_14.weight",
          "340",
          "341"
        ],
        "output": [
          "342"
        ],
        "name": "QuantizeLinear_177",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "343"
        ],
        "name": "Constant_178",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "344"
        ],
        "name": "Constant_179",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "342",
          "343",
          "344"
        ],
        "output": [
          "345"
        ],
        "name": "DequantizeLinear_180",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "346"
        ],
        "name": "Constant_181",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "347"
        ],
        "name": "Constant_182",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_14.bias",
          "346",
          "347"
        ],
        "output": [
          "348"
        ],
        "name": "QuantizeLinear_183",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "349"
        ],
        "name": "Constant_184",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "350"
        ],
        "name": "Constant_185",
        "opType": "Constant",
