{
  "irVersion": "7",
  "producerName": "pytorch",
  "producerVersion": "1.10",
  "graph": {
    "node": [
      {
        "output": [
          "117"
        ],
        "name": "Constant_0",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "118"
        ],
        "name": "Constant_1",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "119"
        ],
        "name": "Constant_2",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "117",
          "118",
          "119"
        ],
        "output": [
          "120"
        ],
        "name": "QuantizeLinear_3",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "121"
        ],
        "name": "Constant_4",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "122"
        ],
        "name": "Constant_5",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "120",
          "121",
          "122"
        ],
        "output": [
          "123"
        ],
        "name": "DequantizeLinear_6",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "124"
        ],
        "name": "Constant_7",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "125"
        ],
        "name": "Constant_8",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "126"
        ],
        "name": "Constant_9",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "124",
          "125",
          "126"
        ],
        "output": [
          "127"
        ],
        "name": "QuantizeLinear_10",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "128"
        ],
        "name": "Constant_11",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "129"
        ],
        "name": "Constant_12",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "127",
          "128",
          "129"
        ],
        "output": [
          "130"
        ],
        "name": "DequantizeLinear_13",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "131"
        ],
        "name": "Constant_14",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "132"
        ],
        "name": "Constant_15",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "133"
        ],
        "name": "Constant_16",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "131",
          "132",
          "133"
        ],
        "output": [
          "134"
        ],
        "name": "QuantizeLinear_17",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "135"
        ],
        "name": "Constant_18",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "136"
        ],
        "name": "Constant_19",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "134",
          "135",
          "136"
        ],
        "output": [
          "137"
        ],
        "name": "DequantizeLinear_20",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "138"
        ],
        "name": "Constant_21",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "139"
        ],
        "name": "Constant_22",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "140"
        ],
        "name": "Constant_23",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "138",
          "139",
          "140"
        ],
        "output": [
          "141"
        ],
        "name": "QuantizeLinear_24",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "142"
        ],
        "name": "Constant_25",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "143"
        ],
        "name": "Constant_26",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "141",
          "142",
          "143"
        ],
        "output": [
          "144"
        ],
        "name": "DequantizeLinear_27",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "145"
        ],
        "name": "Constant_28",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "146"
        ],
        "name": "Constant_29",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "147"
        ],
        "name": "Constant_30",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "145",
          "146",
          "147"
        ],
        "output": [
          "148"
        ],
        "name": "QuantizeLinear_31",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "149"
        ],
        "name": "Constant_32",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "150"
        ],
        "name": "Constant_33",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "148",
          "149",
          "150"
        ],
        "output": [
          "151"
        ],
        "name": "DequantizeLinear_34",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "152"
        ],
        "name": "Constant_35",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "153"
        ],
        "name": "Constant_36",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "154"
        ],
        "name": "Constant_37",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "152",
          "153",
          "154"
        ],
        "output": [
          "155"
        ],
        "name": "QuantizeLinear_38",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "156"
        ],
        "name": "Constant_39",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "157"
        ],
        "name": "Constant_40",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "155",
          "156",
          "157"
        ],
        "output": [
          "158"
        ],
        "name": "DequantizeLinear_41",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "159"
        ],
        "name": "Constant_42",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "160"
        ],
        "name": "Constant_43",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "res.13",
          "159",
          "160"
        ],
        "output": [
          "161"
        ],
        "name": "QuantizeLinear_44",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "162"
        ],
        "name": "Constant_45",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "163"
        ],
        "name": "Constant_46",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "161",
          "162",
          "163"
        ],
        "output": [
          "164"
        ],
        "name": "DequantizeLinear_47",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "165"
        ],
        "name": "Constant_48",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "164",
          "165"
        ],
        "output": [
          "166"
        ],
        "name": "Gather_49",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "167"
        ],
        "name": "Constant_50",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "166",
          "167"
        ],
        "output": [
          "168"
        ],
        "name": "Unsqueeze_51",
        "opType": "Unsqueeze"
      },
      {
        "output": [
          "169"
        ],
        "name": "Constant_52",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "170"
        ],
        "name": "Constant_53",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "168",
          "169",
          "170"
        ],
        "output": [
          "171"
        ],
        "name": "QuantizeLinear_54",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "172"
        ],
        "name": "Constant_55",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "173"
        ],
        "name": "Constant_56",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "171",
          "172",
          "173"
        ],
        "output": [
          "174"
        ],
        "name": "DequantizeLinear_57",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "174",
          "123"
        ],
        "output": [
          "175"
        ],
        "name": "Mul_58",
        "opType": "Mul"
      },
      {
        "output": [
          "176"
        ],
        "name": "Constant_59",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "177"
        ],
        "name": "Constant_60",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "175",
          "176",
          "177"
        ],
        "output": [
          "178"
        ],
        "name": "QuantizeLinear_61",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "179"
        ],
        "name": "Constant_62",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "180"
        ],
        "name": "Constant_63",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "178",
          "179",
          "180"
        ],
        "output": [
          "181"
        ],
        "name": "DequantizeLinear_64",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "181",
          "144"
        ],
        "output": [
          "182"
        ],
        "name": "Add_65",
        "opType": "Add"
      },
      {
        "output": [
          "183"
        ],
        "name": "Constant_66",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "164",
          "183"
        ],
        "output": [
          "184"
        ],
        "name": "Gather_67",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "185"
        ],
        "name": "Constant_68",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "184",
          "185"
        ],
        "output": [
          "186"
        ],
        "name": "Unsqueeze_69",
        "opType": "Unsqueeze"
      },
      {
        "output": [
          "187"
        ],
        "name": "Constant_70",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "188"
        ],
        "name": "Constant_71",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "186",
          "187",
          "188"
        ],
        "output": [
          "189"
        ],
        "name": "QuantizeLinear_72",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "190"
        ],
        "name": "Constant_73",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "191"
        ],
        "name": "Constant_74",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "189",
          "190",
          "191"
        ],
        "output": [
          "192"
        ],
        "name": "DequantizeLinear_75",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "192",
          "130"
        ],
        "output": [
          "193"
        ],
        "name": "Mul_76",
        "opType": "Mul"
      },
      {
        "output": [
          "194"
        ],
        "name": "Constant_77",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "195"
        ],
        "name": "Constant_78",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "193",
          "194",
          "195"
        ],
        "output": [
          "196"
        ],
        "name": "QuantizeLinear_79",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "197"
        ],
        "name": "Constant_80",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "198"
        ],
        "name": "Constant_81",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "196",
          "197",
          "198"
        ],
        "output": [
          "199"
        ],
        "name": "DequantizeLinear_82",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "199",
          "151"
        ],
        "output": [
          "200"
        ],
        "name": "Add_83",
        "opType": "Add"
      },
      {
        "output": [
          "201"
        ],
        "name": "Constant_84",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "164",
          "201"
        ],
        "output": [
          "202"
        ],
        "name": "Gather_85",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "203"
        ],
        "name": "Constant_86",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "202",
          "203"
        ],
        "output": [
          "204"
        ],
        "name": "Unsqueeze_87",
        "opType": "Unsqueeze"
      },
      {
        "output": [
          "205"
        ],
        "name": "Constant_88",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "206"
        ],
        "name": "Constant_89",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "204",
          "205",
          "206"
        ],
        "output": [
          "207"
        ],
        "name": "QuantizeLinear_90",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "208"
        ],
        "name": "Constant_91",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "209"
        ],
        "name": "Constant_92",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "207",
          "208",
          "209"
        ],
        "output": [
          "210"
        ],
        "name": "DequantizeLinear_93",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "210",
          "137"
        ],
        "output": [
          "211"
        ],
        "name": "Mul_94",
        "opType": "Mul"
      },
      {
        "output": [
          "212"
        ],
        "name": "Constant_95",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "213"
        ],
        "name": "Constant_96",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "211",
          "212",
          "213"
        ],
        "output": [
          "214"
        ],
        "name": "QuantizeLinear_97",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "215"
        ],
        "name": "Constant_98",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "216"
        ],
        "name": "Constant_99",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "214",
          "215",
          "216"
        ],
        "output": [
          "217"
        ],
        "name": "DequantizeLinear_100",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "217",
          "158"
        ],
        "output": [
          "218"
        ],
        "name": "Add_101",
        "opType": "Add"
      },
      {
        "input": [
          "182",
          "200",
          "218"
        ],
        "output": [
          "219"
        ],
        "name": "Concat_102",
        "opType": "Concat",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "220"
        ],
        "name": "Constant_103",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "221"
        ],
        "name": "Constant_104",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "219",
          "220",
          "221"
        ],
        "output": [
          "222"
        ],
        "name": "QuantizeLinear_105",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "223"
        ],
        "name": "Constant_106",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "224"
        ],
        "name": "Constant_107",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "222",
          "223",
          "224"
        ],
        "output": [
          "225"
        ],
        "name": "DequantizeLinear_108",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "226"
        ],
        "name": "Constant_109",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "227"
        ],
        "name": "Constant_110",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_23.weight",
          "226",
          "227"
        ],
        "output": [
          "228"
        ],
        "name": "QuantizeLinear_111",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "229"
        ],
        "name": "Constant_112",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "230"
        ],
        "name": "Constant_113",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "228",
          "229",
          "230"
        ],
        "output": [
          "231"
        ],
        "name": "DequantizeLinear_114",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "232"
        ],
        "name": "Constant_115",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "233"
        ],
        "name": "Constant_116",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_23.bias",
          "232",
          "233"
        ],
        "output": [
          "234"
        ],
        "name": "QuantizeLinear_117",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "235"
        ],
        "name": "Constant_118",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "236"
        ],
        "name": "Constant_119",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "234",
          "235",
          "236"
        ],
        "output": [
          "237"
        ],
        "name": "DequantizeLinear_120",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "225",
          "231",
          "237"
        ],
        "output": [
          "238"
        ],
        "name": "Conv_121",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "7",
              "7"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "3",
              "3",
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "238"
        ],
        "output": [
          "239"
        ],
        "name": "Relu_122",
        "opType": "Relu"
      },
      {
        "output": [
          "240"
        ],
        "name": "Constant_123",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "241"
        ],
        "name": "Constant_124",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "239",
          "240",
          "241"
        ],
        "output": [
          "242"
        ],
        "name": "QuantizeLinear_125",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "243"
        ],
        "name": "Constant_126",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "244"
        ],
        "name": "Constant_127",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "242",
          "243",
          "244"
        ],
        "output": [
          "245"
        ],
        "name": "DequantizeLinear_128",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "245"
        ],
        "output": [
          "246"
        ],
        "name": "MaxPool_129",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "247"
        ],
        "name": "Constant_130",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "248"
        ],
        "name": "Constant_131",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "246",
          "247",
          "248"
        ],
        "output": [
          "249"
        ],
        "name": "QuantizeLinear_132",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "250"
        ],
        "name": "Constant_133",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "251"
        ],
        "name": "Constant_134",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "249",
          "250",
          "251"
        ],
        "output": [
          "252"
        ],
        "name": "DequantizeLinear_135",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "253"
        ],
        "name": "Constant_136",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "254"
        ],
        "name": "Constant_137",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_26.weight",
          "253",
          "254"
        ],
        "output": [
          "255"
        ],
        "name": "QuantizeLinear_138",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "256"
        ],
        "name": "Constant_139",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "257"
        ],
        "name": "Constant_140",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "255",
          "256",
          "257"
        ],
        "output": [
          "258"
        ],
        "name": "DequantizeLinear_141",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "259"
        ],
        "name": "Constant_142",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "260"
        ],
        "name": "Constant_143",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_26.bias",
          "259",
          "260"
        ],
        "output": [
          "261"
        ],
        "name": "QuantizeLinear_144",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "262"
        ],
        "name": "Constant_145",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "263"
        ],
        "name": "Constant_146",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "261",
          "262",
          "263"
        ],
        "output": [
          "264"
        ],
        "name": "DequantizeLinear_147",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "252",
          "258",
          "264"
        ],
        "output": [
          "265"
        ],
        "name": "Conv_148",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "265"
        ],
        "output": [
          "266"
        ],
        "name": "Relu_149",
        "opType": "Relu"
      },
      {
        "output": [
          "267"
        ],
        "name": "Constant_150",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "268"
        ],
        "name": "Constant_151",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "266",
          "267",
          "268"
        ],
        "output": [
          "269"
        ],
        "name": "QuantizeLinear_152",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "270"
        ],
        "name": "Constant_153",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "271"
        ],
        "name": "Constant_154",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "269",
          "270",
          "271"
        ],
        "output": [
          "272"
        ],
        "name": "DequantizeLinear_155",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "273"
        ],
        "name": "Constant_156",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "274"
        ],
        "name": "Constant_157",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_28.weight",
          "273",
          "274"
        ],
        "output": [
          "275"
        ],
        "name": "QuantizeLinear_158",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "276"
        ],
        "name": "Constant_159",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "277"
        ],
        "name": "Constant_160",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "275",
          "276",
          "277"
        ],
        "output": [
          "278"
        ],
        "name": "DequantizeLinear_161",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "279"
        ],
        "name": "Constant_162",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "280"
        ],
        "name": "Constant_163",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_28.bias",
          "279",
          "280"
        ],
        "output": [
          "281"
        ],
        "name": "QuantizeLinear_164",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "282"
        ],
        "name": "Constant_165",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "283"
        ],
        "name": "Constant_166",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "281",
          "282",
          "283"
        ],
        "output": [
          "284"
        ],
        "name": "DequantizeLinear_167",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "272",
          "278",
          "284"
        ],
        "output": [
          "285"
        ],
        "name": "Conv_168",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "285"
        ],
        "output": [
          "286"
        ],
        "name": "Relu_169",
        "opType": "Relu"
      },
      {
        "output": [
          "287"
        ],
        "name": "Constant_170",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "288"
        ],
        "name": "Constant_171",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "286",
          "287",
          "288"
        ],
        "output": [
          "289"
        ],
        "name": "QuantizeLinear_172",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "290"
        ],
        "name": "Constant_173",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "291"
        ],
        "name": "Constant_174",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "289",
          "290",
          "291"
        ],
        "output": [
          "292"
        ],
        "name": "DequantizeLinear_175",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "292"
        ],
        "output": [
          "293"
        ],
        "name": "MaxPool_176",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "294"
        ],
        "name": "Constant_177",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "295"
        ],
        "name": "Constant_178",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "293",
          "294",
          "295"
        ],
        "output": [
          "296"
        ],
        "name": "QuantizeLinear_179",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "297"
        ],
        "name": "Constant_180",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "298"
        ],
        "name": "Constant_181",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "296",
          "297",
          "298"
        ],
        "output": [
          "299"
        ],
        "name": "DequantizeLinear_182",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "300"
        ],
        "name": "Constant_183",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "301"
        ],
        "name": "Constant_184",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_31.weight",
          "300",
          "301"
        ],
        "output": [
          "302"
        ],
        "name": "QuantizeLinear_185",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "303"
        ],
        "name": "Constant_186",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "304"
        ],
        "name": "Constant_187",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "302",
          "303",
          "304"
        ],
        "output": [
          "305"
        ],
