{
  "irVersion": "7",
  "producerName": "pytorch",
  "producerVersion": "1.10",
  "graph": {
    "node": [
      {
        "output": [
          "191"
        ],
        "name": "Constant_0",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "192"
        ],
        "name": "Constant_1",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "193"
        ],
        "name": "Constant_2",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "191",
          "192",
          "193"
        ],
        "output": [
          "194"
        ],
        "name": "QuantizeLinear_3",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "195"
        ],
        "name": "Constant_4",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "196"
        ],
        "name": "Constant_5",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "194",
          "195",
          "196"
        ],
        "output": [
          "197"
        ],
        "name": "DequantizeLinear_6",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "198"
        ],
        "name": "Constant_7",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "199"
        ],
        "name": "Constant_8",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "200"
        ],
        "name": "Constant_9",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "198",
          "199",
          "200"
        ],
        "output": [
          "201"
        ],
        "name": "QuantizeLinear_10",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "202"
        ],
        "name": "Constant_11",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "203"
        ],
        "name": "Constant_12",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "201",
          "202",
          "203"
        ],
        "output": [
          "204"
        ],
        "name": "DequantizeLinear_13",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "205"
        ],
        "name": "Constant_14",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "206"
        ],
        "name": "Constant_15",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "207"
        ],
        "name": "Constant_16",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "205",
          "206",
          "207"
        ],
        "output": [
          "208"
        ],
        "name": "QuantizeLinear_17",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "209"
        ],
        "name": "Constant_18",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "210"
        ],
        "name": "Constant_19",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "208",
          "209",
          "210"
        ],
        "output": [
          "211"
        ],
        "name": "DequantizeLinear_20",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "212"
        ],
        "name": "Constant_21",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "213"
        ],
        "name": "Constant_22",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "214"
        ],
        "name": "Constant_23",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "212",
          "213",
          "214"
        ],
        "output": [
          "215"
        ],
        "name": "QuantizeLinear_24",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "216"
        ],
        "name": "Constant_25",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "217"
        ],
        "name": "Constant_26",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "215",
          "216",
          "217"
        ],
        "output": [
          "218"
        ],
        "name": "DequantizeLinear_27",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "219"
        ],
        "name": "Constant_28",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "220"
        ],
        "name": "Constant_29",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "221"
        ],
        "name": "Constant_30",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "219",
          "220",
          "221"
        ],
        "output": [
          "222"
        ],
        "name": "QuantizeLinear_31",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "223"
        ],
        "name": "Constant_32",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "224"
        ],
        "name": "Constant_33",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "222",
          "223",
          "224"
        ],
        "output": [
          "225"
        ],
        "name": "DequantizeLinear_34",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "226"
        ],
        "name": "Constant_35",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "227"
        ],
        "name": "Constant_36",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "228"
        ],
        "name": "Constant_37",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "226",
          "227",
          "228"
        ],
        "output": [
          "229"
        ],
        "name": "QuantizeLinear_38",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "230"
        ],
        "name": "Constant_39",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "231"
        ],
        "name": "Constant_40",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "229",
          "230",
          "231"
        ],
        "output": [
          "232"
        ],
        "name": "DequantizeLinear_41",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "233"
        ],
        "name": "Constant_42",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "234"
        ],
        "name": "Constant_43",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "res.13",
          "233",
          "234"
        ],
        "output": [
          "235"
        ],
        "name": "QuantizeLinear_44",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "236"
        ],
        "name": "Constant_45",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "237"
        ],
        "name": "Constant_46",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "235",
          "236",
          "237"
        ],
        "output": [
          "238"
        ],
        "name": "DequantizeLinear_47",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "239"
        ],
        "name": "Constant_48",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "238",
          "239"
        ],
        "output": [
          "240"
        ],
        "name": "Gather_49",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "241"
        ],
        "name": "Constant_50",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "240",
          "241"
        ],
        "output": [
          "242"
        ],
        "name": "Unsqueeze_51",
        "opType": "Unsqueeze"
      },
      {
        "output": [
          "243"
        ],
        "name": "Constant_52",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "244"
        ],
        "name": "Constant_53",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "242",
          "243",
          "244"
        ],
        "output": [
          "245"
        ],
        "name": "QuantizeLinear_54",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "246"
        ],
        "name": "Constant_55",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "247"
        ],
        "name": "Constant_56",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "245",
          "246",
          "247"
        ],
        "output": [
          "248"
        ],
        "name": "DequantizeLinear_57",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "248",
          "197"
        ],
        "output": [
          "249"
        ],
        "name": "Mul_58",
        "opType": "Mul"
      },
      {
        "output": [
          "250"
        ],
        "name": "Constant_59",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "251"
        ],
        "name": "Constant_60",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "249",
          "250",
          "251"
        ],
        "output": [
          "252"
        ],
        "name": "QuantizeLinear_61",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "253"
        ],
        "name": "Constant_62",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "254"
        ],
        "name": "Constant_63",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "252",
          "253",
          "254"
        ],
        "output": [
          "255"
        ],
        "name": "DequantizeLinear_64",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "255",
          "218"
        ],
        "output": [
          "256"
        ],
        "name": "Add_65",
        "opType": "Add"
      },
      {
        "output": [
          "257"
        ],
        "name": "Constant_66",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "238",
          "257"
        ],
        "output": [
          "258"
        ],
        "name": "Gather_67",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "259"
        ],
        "name": "Constant_68",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "258",
          "259"
        ],
        "output": [
          "260"
        ],
        "name": "Unsqueeze_69",
        "opType": "Unsqueeze"
      },
      {
        "output": [
          "261"
        ],
        "name": "Constant_70",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "262"
        ],
        "name": "Constant_71",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "260",
          "261",
          "262"
        ],
        "output": [
          "263"
        ],
        "name": "QuantizeLinear_72",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "264"
        ],
        "name": "Constant_73",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "265"
        ],
        "name": "Constant_74",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "263",
          "264",
          "265"
        ],
        "output": [
          "266"
        ],
        "name": "DequantizeLinear_75",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "266",
          "204"
        ],
        "output": [
          "267"
        ],
        "name": "Mul_76",
        "opType": "Mul"
      },
      {
        "output": [
          "268"
        ],
        "name": "Constant_77",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "269"
        ],
        "name": "Constant_78",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "267",
          "268",
          "269"
        ],
        "output": [
          "270"
        ],
        "name": "QuantizeLinear_79",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "271"
        ],
        "name": "Constant_80",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "272"
        ],
        "name": "Constant_81",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "270",
          "271",
          "272"
        ],
        "output": [
          "273"
        ],
        "name": "DequantizeLinear_82",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "273",
          "225"
        ],
        "output": [
          "274"
        ],
        "name": "Add_83",
        "opType": "Add"
      },
      {
        "output": [
          "275"
        ],
        "name": "Constant_84",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "238",
          "275"
        ],
        "output": [
          "276"
        ],
        "name": "Gather_85",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "277"
        ],
        "name": "Constant_86",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "276",
          "277"
        ],
        "output": [
          "278"
        ],
        "name": "Unsqueeze_87",
        "opType": "Unsqueeze"
      },
      {
        "output": [
          "279"
        ],
        "name": "Constant_88",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "280"
        ],
        "name": "Constant_89",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "278",
          "279",
          "280"
        ],
        "output": [
          "281"
        ],
        "name": "QuantizeLinear_90",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "282"
        ],
        "name": "Constant_91",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "283"
        ],
        "name": "Constant_92",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "281",
          "282",
          "283"
        ],
        "output": [
          "284"
        ],
        "name": "DequantizeLinear_93",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "284",
          "211"
        ],
        "output": [
          "285"
        ],
        "name": "Mul_94",
        "opType": "Mul"
      },
      {
        "output": [
          "286"
        ],
        "name": "Constant_95",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "287"
        ],
        "name": "Constant_96",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "285",
          "286",
          "287"
        ],
        "output": [
          "288"
        ],
        "name": "QuantizeLinear_97",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "289"
        ],
        "name": "Constant_98",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "290"
        ],
        "name": "Constant_99",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "288",
          "289",
          "290"
        ],
        "output": [
          "291"
        ],
        "name": "DequantizeLinear_100",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "291",
          "232"
        ],
        "output": [
          "292"
        ],
        "name": "Add_101",
        "opType": "Add"
      },
      {
        "input": [
          "256",
          "274",
          "292"
        ],
        "output": [
          "293"
        ],
        "name": "Concat_102",
        "opType": "Concat",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "294"
        ],
        "name": "Constant_103",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "295"
        ],
        "name": "Constant_104",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "293",
          "294",
          "295"
        ],
        "output": [
          "296"
        ],
        "name": "QuantizeLinear_105",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "297"
        ],
        "name": "Constant_106",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "298"
        ],
        "name": "Constant_107",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "296",
          "297",
          "298"
        ],
        "output": [
          "299"
        ],
        "name": "DequantizeLinear_108",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "300"
        ],
        "name": "Constant_109",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "301"
        ],
        "name": "Constant_110",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_23.weight",
          "300",
          "301"
        ],
        "output": [
          "302"
        ],
        "name": "QuantizeLinear_111",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "303"
        ],
        "name": "Constant_112",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "304"
        ],
        "name": "Constant_113",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "302",
          "303",
          "304"
        ],
        "output": [
          "305"
        ],
        "name": "DequantizeLinear_114",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "306"
        ],
        "name": "Constant_115",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "307"
        ],
        "name": "Constant_116",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_23.bias",
          "306",
          "307"
        ],
        "output": [
          "308"
        ],
        "name": "QuantizeLinear_117",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "309"
        ],
        "name": "Constant_118",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "310"
        ],
        "name": "Constant_119",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "308",
          "309",
          "310"
        ],
        "output": [
          "311"
        ],
        "name": "DequantizeLinear_120",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "299",
          "305",
          "311"
        ],
        "output": [
          "312"
        ],
        "name": "Conv_121",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "312"
        ],
        "output": [
          "313"
        ],
        "name": "Relu_122",
        "opType": "Relu"
      },
      {
        "output": [
          "314"
        ],
        "name": "Constant_123",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "315"
        ],
        "name": "Constant_124",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "313",
          "314",
          "315"
        ],
        "output": [
          "316"
        ],
        "name": "QuantizeLinear_125",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "317"
        ],
        "name": "Constant_126",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "318"
        ],
        "name": "Constant_127",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "316",
          "317",
          "318"
        ],
        "output": [
          "319"
        ],
        "name": "DequantizeLinear_128",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "320"
        ],
        "name": "Constant_129",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "321"
        ],
        "name": "Constant_130",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_25.weight",
          "320",
          "321"
        ],
        "output": [
          "322"
        ],
        "name": "QuantizeLinear_131",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "323"
        ],
        "name": "Constant_132",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "324"
        ],
        "name": "Constant_133",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "322",
          "323",
          "324"
        ],
        "output": [
          "325"
        ],
        "name": "DequantizeLinear_134",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "326"
        ],
        "name": "Constant_135",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "327"
        ],
        "name": "Constant_136",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_25.bias",
          "326",
          "327"
        ],
        "output": [
          "328"
        ],
        "name": "QuantizeLinear_137",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "329"
        ],
        "name": "Constant_138",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "330"
        ],
        "name": "Constant_139",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "328",
          "329",
          "330"
        ],
        "output": [
          "331"
        ],
        "name": "DequantizeLinear_140",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "319",
          "325",
          "331"
        ],
        "output": [
          "332"
        ],
        "name": "Conv_141",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "332"
        ],
        "output": [
          "333"
        ],
        "name": "Relu_142",
        "opType": "Relu"
      },
      {
        "output": [
          "334"
        ],
        "name": "Constant_143",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "335"
        ],
        "name": "Constant_144",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "333",
          "334",
          "335"
        ],
        "output": [
          "336"
        ],
        "name": "QuantizeLinear_145",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "337"
        ],
        "name": "Constant_146",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "338"
        ],
        "name": "Constant_147",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "336",
          "337",
          "338"
        ],
        "output": [
          "339"
        ],
        "name": "DequantizeLinear_148",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "340"
        ],
        "name": "Constant_149",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "341"
        ],
        "name": "Constant_150",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_27.weight",
          "340",
          "341"
        ],
        "output": [
          "342"
        ],
        "name": "QuantizeLinear_151",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "343"
        ],
        "name": "Constant_152",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "344"
        ],
        "name": "Constant_153",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "342",
          "343",
          "344"
        ],
        "output": [
          "345"
        ],
        "name": "DequantizeLinear_154",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "346"
        ],
        "name": "Constant_155",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "347"
        ],
        "name": "Constant_156",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_27.bias",
          "346",
          "347"
        ],
        "output": [
          "348"
        ],
        "name": "QuantizeLinear_157",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "349"
        ],
        "name": "Constant_158",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "350"
        ],
        "name": "Constant_159",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "348",
          "349",
          "350"
        ],
        "output": [
          "351"
        ],
        "name": "DequantizeLinear_160",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "339",
          "345",
          "351"
        ],
        "output": [
          "352"
        ],
        "name": "Conv_161",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "352"
        ],
        "output": [
          "353"
        ],
        "name": "Relu_162",
        "opType": "Relu"
      },
      {
        "output": [
          "354"
        ],
        "name": "Constant_163",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "355"
        ],
        "name": "Constant_164",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "353",
          "354",
          "355"
        ],
        "output": [
          "356"
        ],
        "name": "QuantizeLinear_165",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "357"
        ],
        "name": "Constant_166",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "358"
        ],
        "name": "Constant_167",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "356",
          "357",
          "358"
        ],
        "output": [
          "359"
        ],
        "name": "DequantizeLinear_168",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "359"
        ],
        "output": [
          "360"
        ],
        "name": "MaxPool_169",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "361"
        ],
        "name": "Constant_170",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "362"
        ],
        "name": "Constant_171",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "360",
          "361",
          "362"
        ],
        "output": [
          "363"
        ],
        "name": "QuantizeLinear_172",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "364"
        ],
        "name": "Constant_173",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "365"
        ],
        "name": "Constant_174",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "363",
          "364",
          "365"
        ],
        "output": [
          "366"
        ],
        "name": "DequantizeLinear_175",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "367"
        ],
        "name": "Constant_176",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "368"
        ],
        "name": "Constant_177",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_30.weight",
          "367",
          "368"
        ],
        "output": [
          "369"
        ],
        "name": "QuantizeLinear_178",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "370"
        ],
        "name": "Constant_179",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "371"
        ],
        "name": "Constant_180",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "369",
          "370",
          "371"
        ],
        "output": [
          "372"
        ],
        "name": "DequantizeLinear_181",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "373"
        ],
        "name": "Constant_182",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "374"
        ],
        "name": "Constant_183",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_30.bias",
          "373",
          "374"
        ],
        "output": [
          "375"
        ],
        "name": "QuantizeLinear_184",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "376"
        ],
        "name": "Constant_185",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "377"
        ],
        "name": "Constant_186",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "375",
          "376",
          "377"
        ],
        "output": [
          "378"
        ],
        "name": "DequantizeLinear_187",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "366",
          "372",
          "378"
        ],
        "output": [
          "379"
        ],
        "name": "Conv_188",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
