{
  "irVersion": "7",
  "producerName": "pytorch",
  "producerVersion": "1.10",
  "graph": {
    "node": [
      {
        "output": [
          "107"
        ],
        "name": "Constant_0",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "108"
        ],
        "name": "Constant_1",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "res.1",
          "107",
          "108"
        ],
        "output": [
          "109"
        ],
        "name": "QuantizeLinear_2",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "110"
        ],
        "name": "Constant_3",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "111"
        ],
        "name": "Constant_4",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "109",
          "110",
          "111"
        ],
        "output": [
          "112"
        ],
        "name": "DequantizeLinear_5",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "113"
        ],
        "name": "Constant_6",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "114"
        ],
        "name": "Constant_7",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.weight",
          "113",
          "114"
        ],
        "output": [
          "115"
        ],
        "name": "QuantizeLinear_8",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "116"
        ],
        "name": "Constant_9",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "117"
        ],
        "name": "Constant_10",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "115",
          "116",
          "117"
        ],
        "output": [
          "118"
        ],
        "name": "DequantizeLinear_11",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "119"
        ],
        "name": "Constant_12",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "120"
        ],
        "name": "Constant_13",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.bias",
          "119",
          "120"
        ],
        "output": [
          "121"
        ],
        "name": "QuantizeLinear_14",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "122"
        ],
        "name": "Constant_15",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "123"
        ],
        "name": "Constant_16",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "121",
          "122",
          "123"
        ],
        "output": [
          "124"
        ],
        "name": "DequantizeLinear_17",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "112",
          "118",
          "124"
        ],
        "output": [
          "125"
        ],
        "name": "Conv_18",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "125"
        ],
        "output": [
          "126"
        ],
        "name": "Relu_19",
        "opType": "Relu"
      },
      {
        "output": [
          "127"
        ],
        "name": "Constant_20",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "128"
        ],
        "name": "Constant_21",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "126",
          "127",
          "128"
        ],
        "output": [
          "129"
        ],
        "name": "QuantizeLinear_22",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "130"
        ],
        "name": "Constant_23",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "131"
        ],
        "name": "Constant_24",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "129",
          "130",
          "131"
        ],
        "output": [
          "132"
        ],
        "name": "DequantizeLinear_25",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "133"
        ],
        "name": "Constant_26",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "134"
        ],
        "name": "Constant_27",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_3.weight",
          "133",
          "134"
        ],
        "output": [
          "135"
        ],
        "name": "QuantizeLinear_28",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "136"
        ],
        "name": "Constant_29",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "137"
        ],
        "name": "Constant_30",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "135",
          "136",
          "137"
        ],
        "output": [
          "138"
        ],
        "name": "DequantizeLinear_31",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "139"
        ],
        "name": "Constant_32",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "140"
        ],
        "name": "Constant_33",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_3.bias",
          "139",
          "140"
        ],
        "output": [
          "141"
        ],
        "name": "QuantizeLinear_34",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "142"
        ],
        "name": "Constant_35",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "143"
        ],
        "name": "Constant_36",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "141",
          "142",
          "143"
        ],
        "output": [
          "144"
        ],
        "name": "DequantizeLinear_37",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "132",
          "138",
          "144"
        ],
        "output": [
          "145"
        ],
        "name": "Conv_38",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "32",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "145"
        ],
        "output": [
          "146"
        ],
        "name": "Relu_39",
        "opType": "Relu"
      },
      {
        "output": [
          "147"
        ],
        "name": "Constant_40",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "148"
        ],
        "name": "Constant_41",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "146",
          "147",
          "148"
        ],
        "output": [
          "149"
        ],
        "name": "QuantizeLinear_42",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "150"
        ],
        "name": "Constant_43",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "151"
        ],
        "name": "Constant_44",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "149",
          "150",
          "151"
        ],
        "output": [
          "152"
        ],
        "name": "DequantizeLinear_45",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "153"
        ],
        "name": "Constant_46",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "154"
        ],
        "name": "Constant_47",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_5.weight",
          "153",
          "154"
        ],
        "output": [
          "155"
        ],
        "name": "QuantizeLinear_48",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "156"
        ],
        "name": "Constant_49",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "157"
        ],
        "name": "Constant_50",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "155",
          "156",
          "157"
        ],
        "output": [
          "158"
        ],
        "name": "DequantizeLinear_51",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "159"
        ],
        "name": "Constant_52",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "160"
        ],
        "name": "Constant_53",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_5.bias",
          "159",
          "160"
        ],
        "output": [
          "161"
        ],
        "name": "QuantizeLinear_54",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "162"
        ],
        "name": "Constant_55",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "163"
        ],
        "name": "Constant_56",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "161",
          "162",
          "163"
        ],
        "output": [
          "164"
        ],
        "name": "DequantizeLinear_57",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "152",
          "158",
          "164"
        ],
        "output": [
          "165"
        ],
        "name": "Conv_58",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "166"
        ],
        "name": "Constant_59",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "167"
        ],
        "name": "Constant_60",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "165",
          "166",
          "167"
        ],
        "output": [
          "168"
        ],
        "name": "QuantizeLinear_61",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "169"
        ],
        "name": "Constant_62",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "170"
        ],
        "name": "Constant_63",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "168",
          "169",
          "170"
        ],
        "output": [
          "171"
        ],
        "name": "DequantizeLinear_64",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "172"
        ],
        "name": "Constant_65",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "173"
        ],
        "name": "Constant_66",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_6.weight",
          "172",
          "173"
        ],
        "output": [
          "174"
        ],
        "name": "QuantizeLinear_67",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "175"
        ],
        "name": "Constant_68",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "176"
        ],
        "name": "Constant_69",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "174",
          "175",
          "176"
        ],
        "output": [
          "177"
        ],
        "name": "DequantizeLinear_70",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "178"
        ],
        "name": "Constant_71",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "179"
        ],
        "name": "Constant_72",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_6.bias",
          "178",
          "179"
        ],
        "output": [
          "180"
        ],
        "name": "QuantizeLinear_73",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "181"
        ],
        "name": "Constant_74",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "182"
        ],
        "name": "Constant_75",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "180",
          "181",
          "182"
        ],
        "output": [
          "183"
        ],
        "name": "DequantizeLinear_76",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "171",
          "177",
          "183"
        ],
        "output": [
          "184"
        ],
        "name": "Conv_77",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "184"
        ],
        "output": [
          "185"
        ],
        "name": "Relu_78",
        "opType": "Relu"
      },
      {
        "output": [
          "186"
        ],
        "name": "Constant_79",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "187"
        ],
        "name": "Constant_80",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "185",
          "186",
          "187"
        ],
        "output": [
          "188"
        ],
        "name": "QuantizeLinear_81",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "189"
        ],
        "name": "Constant_82",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "190"
        ],
        "name": "Constant_83",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "188",
          "189",
          "190"
        ],
        "output": [
          "191"
        ],
        "name": "DequantizeLinear_84",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "192"
        ],
        "name": "Constant_85",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "193"
        ],
        "name": "Constant_86",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_8.weight",
          "192",
          "193"
        ],
        "output": [
          "194"
        ],
        "name": "QuantizeLinear_87",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "195"
        ],
        "name": "Constant_88",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "196"
        ],
        "name": "Constant_89",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "194",
          "195",
          "196"
        ],
        "output": [
          "197"
        ],
        "name": "DequantizeLinear_90",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "198"
        ],
        "name": "Constant_91",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "199"
        ],
        "name": "Constant_92",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_8.bias",
          "198",
          "199"
        ],
        "output": [
          "200"
        ],
        "name": "QuantizeLinear_93",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "201"
        ],
        "name": "Constant_94",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "202"
        ],
        "name": "Constant_95",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "200",
          "201",
          "202"
        ],
        "output": [
          "203"
        ],
        "name": "DequantizeLinear_96",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "191",
          "197",
          "203"
        ],
        "output": [
          "204"
        ],
        "name": "Conv_97",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "96",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "204"
        ],
        "output": [
          "205"
        ],
        "name": "Relu_98",
        "opType": "Relu"
      },
      {
        "output": [
          "206"
        ],
        "name": "Constant_99",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "207"
        ],
        "name": "Constant_100",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "205",
          "206",
          "207"
        ],
        "output": [
          "208"
        ],
        "name": "QuantizeLinear_101",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "209"
        ],
        "name": "Constant_102",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "210"
        ],
        "name": "Constant_103",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "208",
          "209",
          "210"
        ],
        "output": [
          "211"
        ],
        "name": "DequantizeLinear_104",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "212"
        ],
        "name": "Constant_105",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "213"
        ],
        "name": "Constant_106",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_10.weight",
          "212",
          "213"
        ],
        "output": [
          "214"
        ],
        "name": "QuantizeLinear_107",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "215"
        ],
        "name": "Constant_108",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "216"
        ],
        "name": "Constant_109",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "214",
          "215",
          "216"
        ],
        "output": [
          "217"
        ],
        "name": "DequantizeLinear_110",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "218"
        ],
        "name": "Constant_111",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "219"
        ],
        "name": "Constant_112",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_10.bias",
          "218",
          "219"
        ],
        "output": [
          "220"
        ],
        "name": "QuantizeLinear_113",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "221"
        ],
        "name": "Constant_114",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "222"
        ],
        "name": "Constant_115",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "220",
          "221",
          "222"
        ],
        "output": [
          "223"
        ],
        "name": "DequantizeLinear_116",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "211",
          "217",
          "223"
        ],
        "output": [
          "224"
        ],
        "name": "Conv_117",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "225"
        ],
        "name": "Constant_118",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "226"
        ],
        "name": "Constant_119",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "224",
          "225",
          "226"
        ],
        "output": [
          "227"
        ],
        "name": "QuantizeLinear_120",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "228"
        ],
        "name": "Constant_121",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "229"
        ],
        "name": "Constant_122",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "227",
          "228",
          "229"
        ],
        "output": [
          "230"
        ],
        "name": "DequantizeLinear_123",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "231"
        ],
        "name": "Constant_124",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "232"
        ],
        "name": "Constant_125",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_11.weight",
          "231",
          "232"
        ],
        "output": [
          "233"
        ],
        "name": "QuantizeLinear_126",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "234"
        ],
        "name": "Constant_127",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "235"
        ],
        "name": "Constant_128",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "233",
          "234",
          "235"
        ],
        "output": [
          "236"
        ],
        "name": "DequantizeLinear_129",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "237"
        ],
        "name": "Constant_130",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "238"
        ],
        "name": "Constant_131",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_11.bias",
          "237",
          "238"
        ],
        "output": [
          "239"
        ],
        "name": "QuantizeLinear_132",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "240"
        ],
        "name": "Constant_133",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "241"
        ],
        "name": "Constant_134",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "239",
          "240",
          "241"
        ],
        "output": [
          "242"
        ],
        "name": "DequantizeLinear_135",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "230",
          "236",
          "242"
        ],
        "output": [
          "243"
        ],
        "name": "Conv_136",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "243"
        ],
        "output": [
          "244"
        ],
        "name": "Relu_137",
        "opType": "Relu"
      },
      {
        "output": [
          "245"
        ],
        "name": "Constant_138",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "246"
        ],
        "name": "Constant_139",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "244",
          "245",
          "246"
        ],
        "output": [
          "247"
        ],
        "name": "QuantizeLinear_140",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "248"
        ],
        "name": "Constant_141",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "249"
        ],
        "name": "Constant_142",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "247",
          "248",
          "249"
        ],
        "output": [
          "250"
        ],
        "name": "DequantizeLinear_143",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "251"
        ],
        "name": "Constant_144",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "252"
        ],
        "name": "Constant_145",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_13.weight",
          "251",
          "252"
        ],
        "output": [
          "253"
        ],
        "name": "QuantizeLinear_146",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "254"
        ],
        "name": "Constant_147",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "255"
        ],
        "name": "Constant_148",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "253",
          "254",
          "255"
        ],
        "output": [
          "256"
        ],
        "name": "DequantizeLinear_149",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "257"
        ],
        "name": "Constant_150",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "258"
        ],
        "name": "Constant_151",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_13.bias",
          "257",
          "258"
        ],
        "output": [
          "259"
        ],
        "name": "QuantizeLinear_152",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "260"
        ],
        "name": "Constant_153",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "261"
        ],
        "name": "Constant_154",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "259",
          "260",
          "261"
        ],
        "output": [
          "262"
        ],
        "name": "DequantizeLinear_155",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "250",
          "256",
          "262"
        ],
        "output": [
          "263"
        ],
        "name": "Conv_156",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "144",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "263"
        ],
        "output": [
          "264"
        ],
        "name": "Relu_157",
        "opType": "Relu"
      },
      {
        "output": [
          "265"
        ],
        "name": "Constant_158",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "266"
        ],
        "name": "Constant_159",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "264",
          "265",
          "266"
        ],
        "output": [
          "267"
        ],
        "name": "QuantizeLinear_160",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "268"
        ],
        "name": "Constant_161",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "269"
        ],
        "name": "Constant_162",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "267",
          "268",
          "269"
        ],
        "output": [
          "270"
        ],
        "name": "DequantizeLinear_163",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "271"
        ],
        "name": "Constant_164",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "272"
        ],
        "name": "Constant_165",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_15.weight",
          "271",
          "272"
        ],
        "output": [
          "273"
        ],
        "name": "QuantizeLinear_166",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "274"
        ],
        "name": "Constant_167",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "275"
        ],
        "name": "Constant_168",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "273",
          "274",
          "275"
        ],
        "output": [
          "276"
        ],
        "name": "DequantizeLinear_169",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "277"
        ],
        "name": "Constant_170",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "278"
        ],
        "name": "Constant_171",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_15.bias",
          "277",
          "278"
        ],
        "output": [
          "279"
        ],
        "name": "QuantizeLinear_172",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "280"
        ],
        "name": "Constant_173",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "281"
        ],
        "name": "Constant_174",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "279",
          "280",
          "281"
        ],
        "output": [
          "282"
        ],
        "name": "DequantizeLinear_175",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "270",
          "276",
          "282"
        ],
        "output": [
          "283"
        ],
        "name": "Conv_176",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
