{
  "irVersion": "7",
  "producerName": "pytorch",
  "producerVersion": "1.10",
  "graph": {
    "node": [
      {
        "output": [
          "43"
        ],
        "name": "Constant_0",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "44"
        ],
        "name": "Constant_1",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "res.1",
          "43",
          "44"
        ],
        "output": [
          "45"
        ],
        "name": "QuantizeLinear_2",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "46"
        ],
        "name": "Constant_3",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "47"
        ],
        "name": "Constant_4",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "45",
          "46",
          "47"
        ],
        "output": [
          "48"
        ],
        "name": "DequantizeLinear_5",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "49"
        ],
        "name": "Constant_6",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "50"
        ],
        "name": "Constant_7",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.weight",
          "49",
          "50"
        ],
        "output": [
          "51"
        ],
        "name": "QuantizeLinear_8",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "52"
        ],
        "name": "Constant_9",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "53"
        ],
        "name": "Constant_10",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "51",
          "52",
          "53"
        ],
        "output": [
          "54"
        ],
        "name": "DequantizeLinear_11",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "55"
        ],
        "name": "Constant_12",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "56"
        ],
        "name": "Constant_13",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.bias",
          "55",
          "56"
        ],
        "output": [
          "57"
        ],
        "name": "QuantizeLinear_14",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "58"
        ],
        "name": "Constant_15",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "59"
        ],
        "name": "Constant_16",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "57",
          "58",
          "59"
        ],
        "output": [
          "60"
        ],
        "name": "DequantizeLinear_17",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "48",
          "54",
          "60"
        ],
        "output": [
          "61"
        ],
        "name": "Conv_18",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "7",
              "7"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "3",
              "3",
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "61"
        ],
        "output": [
          "62"
        ],
        "name": "Relu_19",
        "opType": "Relu"
      },
      {
        "output": [
          "63"
        ],
        "name": "Constant_20",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "64"
        ],
        "name": "Constant_21",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "62",
          "63",
          "64"
        ],
        "output": [
          "65"
        ],
        "name": "QuantizeLinear_22",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "66"
        ],
        "name": "Constant_23",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "67"
        ],
        "name": "Constant_24",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "65",
          "66",
          "67"
        ],
        "output": [
          "68"
        ],
        "name": "DequantizeLinear_25",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "68"
        ],
        "output": [
          "69"
        ],
        "name": "MaxPool_26",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "70"
        ],
        "name": "Constant_27",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "71"
        ],
        "name": "Constant_28",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "69",
          "70",
          "71"
        ],
        "output": [
          "72"
        ],
        "name": "QuantizeLinear_29",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "73"
        ],
        "name": "Constant_30",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "74"
        ],
        "name": "Constant_31",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "72",
          "73",
          "74"
        ],
        "output": [
          "75"
        ],
        "name": "DequantizeLinear_32",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "76"
        ],
        "name": "Constant_33",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "77"
        ],
        "name": "Constant_34",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_4.weight",
          "76",
          "77"
        ],
        "output": [
          "78"
        ],
        "name": "QuantizeLinear_35",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "79"
        ],
        "name": "Constant_36",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "80"
        ],
        "name": "Constant_37",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "78",
          "79",
          "80"
        ],
        "output": [
          "81"
        ],
        "name": "DequantizeLinear_38",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "82"
        ],
        "name": "Constant_39",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "83"
        ],
        "name": "Constant_40",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_4.bias",
          "82",
          "83"
        ],
        "output": [
          "84"
        ],
        "name": "QuantizeLinear_41",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "85"
        ],
        "name": "Constant_42",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "86"
        ],
        "name": "Constant_43",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "84",
          "85",
          "86"
        ],
        "output": [
          "87"
        ],
        "name": "DequantizeLinear_44",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "75",
          "81",
          "87"
        ],
        "output": [
          "88"
        ],
        "name": "Conv_45",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "88"
        ],
        "output": [
          "89"
        ],
        "name": "Relu_46",
        "opType": "Relu"
      },
      {
        "output": [
          "90"
        ],
        "name": "Constant_47",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "91"
        ],
        "name": "Constant_48",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "89",
          "90",
          "91"
        ],
        "output": [
          "92"
        ],
        "name": "QuantizeLinear_49",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "93"
        ],
        "name": "Constant_50",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "94"
        ],
        "name": "Constant_51",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "92",
          "93",
          "94"
        ],
        "output": [
          "95"
        ],
        "name": "DequantizeLinear_52",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "96"
        ],
        "name": "Constant_53",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "97"
        ],
        "name": "Constant_54",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_6.weight",
          "96",
          "97"
        ],
        "output": [
          "98"
        ],
        "name": "QuantizeLinear_55",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "99"
        ],
        "name": "Constant_56",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "100"
        ],
        "name": "Constant_57",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "98",
          "99",
          "100"
        ],
        "output": [
          "101"
        ],
        "name": "DequantizeLinear_58",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "102"
        ],
        "name": "Constant_59",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "103"
        ],
        "name": "Constant_60",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_6.bias",
          "102",
          "103"
        ],
        "output": [
          "104"
        ],
        "name": "QuantizeLinear_61",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "105"
        ],
        "name": "Constant_62",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "106"
        ],
        "name": "Constant_63",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "104",
          "105",
          "106"
        ],
        "output": [
          "107"
        ],
        "name": "DequantizeLinear_64",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "95",
          "101",
          "107"
        ],
        "output": [
          "108"
        ],
        "name": "Conv_65",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "109"
        ],
        "name": "Constant_66",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "110"
        ],
        "name": "Constant_67",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "108",
          "109",
          "110"
        ],
        "output": [
          "111"
        ],
        "name": "QuantizeLinear_68",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "112"
        ],
        "name": "Constant_69",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "113"
        ],
        "name": "Constant_70",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "111",
          "112",
          "113"
        ],
        "output": [
          "114"
        ],
        "name": "DequantizeLinear_71",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "114",
          "75"
        ],
        "output": [
          "115"
        ],
        "name": "Add_72",
        "opType": "Add"
      },
      {
        "input": [
          "115"
        ],
        "output": [
          "116"
        ],
        "name": "Relu_73",
        "opType": "Relu"
      },
      {
        "output": [
          "117"
        ],
        "name": "Constant_74",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "118"
        ],
        "name": "Constant_75",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "116",
          "117",
          "118"
        ],
        "output": [
          "119"
        ],
        "name": "QuantizeLinear_76",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "120"
        ],
        "name": "Constant_77",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "121"
        ],
        "name": "Constant_78",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "119",
          "120",
          "121"
        ],
        "output": [
          "122"
        ],
        "name": "DequantizeLinear_79",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "123"
        ],
        "name": "Constant_80",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "124"
        ],
        "name": "Constant_81",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_9.weight",
          "123",
          "124"
        ],
        "output": [
          "125"
        ],
        "name": "QuantizeLinear_82",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "126"
        ],
        "name": "Constant_83",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "127"
        ],
        "name": "Constant_84",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "125",
          "126",
          "127"
        ],
        "output": [
          "128"
        ],
        "name": "DequantizeLinear_85",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "129"
        ],
        "name": "Constant_86",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "130"
        ],
        "name": "Constant_87",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_9.bias",
          "129",
          "130"
        ],
        "output": [
          "131"
        ],
        "name": "QuantizeLinear_88",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "132"
        ],
        "name": "Constant_89",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "133"
        ],
        "name": "Constant_90",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "131",
          "132",
          "133"
        ],
        "output": [
          "134"
        ],
        "name": "DequantizeLinear_91",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "122",
          "128",
          "134"
        ],
        "output": [
          "135"
        ],
        "name": "Conv_92",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "135"
        ],
        "output": [
          "136"
        ],
        "name": "Relu_93",
        "opType": "Relu"
      },
      {
        "output": [
          "137"
        ],
        "name": "Constant_94",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "138"
        ],
        "name": "Constant_95",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "136",
          "137",
          "138"
        ],
        "output": [
          "139"
        ],
        "name": "QuantizeLinear_96",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "140"
        ],
        "name": "Constant_97",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "141"
        ],
        "name": "Constant_98",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "139",
          "140",
          "141"
        ],
        "output": [
          "142"
        ],
        "name": "DequantizeLinear_99",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "143"
        ],
        "name": "Constant_100",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "144"
        ],
        "name": "Constant_101",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_11.weight",
          "143",
          "144"
        ],
        "output": [
          "145"
        ],
        "name": "QuantizeLinear_102",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "146"
        ],
        "name": "Constant_103",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "147"
        ],
        "name": "Constant_104",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "145",
          "146",
          "147"
        ],
        "output": [
          "148"
        ],
        "name": "DequantizeLinear_105",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "149"
        ],
        "name": "Constant_106",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "150"
        ],
        "name": "Constant_107",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_11.bias",
          "149",
          "150"
        ],
        "output": [
          "151"
        ],
        "name": "QuantizeLinear_108",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "152"
        ],
        "name": "Constant_109",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "153"
        ],
        "name": "Constant_110",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "151",
          "152",
          "153"
        ],
        "output": [
          "154"
        ],
        "name": "DequantizeLinear_111",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "142",
          "148",
          "154"
        ],
        "output": [
          "155"
        ],
        "name": "Conv_112",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "156"
        ],
        "name": "Constant_113",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "157"
        ],
        "name": "Constant_114",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "155",
          "156",
          "157"
        ],
        "output": [
          "158"
        ],
        "name": "QuantizeLinear_115",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "159"
        ],
        "name": "Constant_116",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "160"
        ],
        "name": "Constant_117",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "158",
          "159",
          "160"
        ],
        "output": [
          "161"
        ],
        "name": "DequantizeLinear_118",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "161",
          "122"
        ],
        "output": [
          "162"
        ],
        "name": "Add_119",
        "opType": "Add"
      },
      {
        "input": [
          "162"
        ],
        "output": [
          "163"
        ],
        "name": "Relu_120",
        "opType": "Relu"
      },
      {
        "output": [
          "164"
        ],
        "name": "Constant_121",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "165"
        ],
        "name": "Constant_122",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "163",
          "164",
          "165"
        ],
        "output": [
          "166"
        ],
        "name": "QuantizeLinear_123",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "167"
        ],
        "name": "Constant_124",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "168"
        ],
        "name": "Constant_125",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "166",
          "167",
          "168"
        ],
        "output": [
          "169"
        ],
        "name": "DequantizeLinear_126",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "170"
        ],
        "name": "Constant_127",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "171"
        ],
        "name": "Constant_128",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_14.weight",
          "170",
          "171"
        ],
        "output": [
          "172"
        ],
        "name": "QuantizeLinear_129",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "173"
        ],
        "name": "Constant_130",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "174"
        ],
        "name": "Constant_131",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "172",
          "173",
          "174"
        ],
        "output": [
          "175"
        ],
        "name": "DequantizeLinear_132",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "176"
        ],
        "name": "Constant_133",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "177"
        ],
        "name": "Constant_134",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_14.bias",
          "176",
          "177"
        ],
        "output": [
          "178"
        ],
        "name": "QuantizeLinear_135",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "179"
        ],
        "name": "Constant_136",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "180"
        ],
        "name": "Constant_137",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "178",
          "179",
          "180"
        ],
        "output": [
          "181"
        ],
        "name": "DequantizeLinear_138",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "169",
          "175",
          "181"
        ],
        "output": [
          "182"
        ],
        "name": "Conv_139",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "182"
        ],
        "output": [
          "183"
        ],
        "name": "Relu_140",
        "opType": "Relu"
      },
      {
        "output": [
          "184"
        ],
        "name": "Constant_141",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "185"
        ],
        "name": "Constant_142",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "183",
          "184",
          "185"
        ],
        "output": [
          "186"
        ],
        "name": "QuantizeLinear_143",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "187"
        ],
        "name": "Constant_144",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "188"
        ],
        "name": "Constant_145",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "186",
          "187",
          "188"
        ],
        "output": [
          "189"
        ],
        "name": "DequantizeLinear_146",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "190"
        ],
        "name": "Constant_147",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "191"
        ],
        "name": "Constant_148",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_16.weight",
          "190",
          "191"
        ],
        "output": [
          "192"
        ],
        "name": "QuantizeLinear_149",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "193"
        ],
        "name": "Constant_150",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "194"
        ],
        "name": "Constant_151",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "192",
          "193",
          "194"
        ],
        "output": [
          "195"
        ],
        "name": "DequantizeLinear_152",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "196"
        ],
        "name": "Constant_153",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "197"
        ],
        "name": "Constant_154",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_16.bias",
          "196",
          "197"
        ],
        "output": [
          "198"
        ],
        "name": "QuantizeLinear_155",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "199"
        ],
        "name": "Constant_156",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "200"
        ],
        "name": "Constant_157",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "198",
          "199",
          "200"
        ],
        "output": [
          "201"
        ],
        "name": "DequantizeLinear_158",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "189",
          "195",
          "201"
        ],
        "output": [
          "202"
        ],
        "name": "Conv_159",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "203"
        ],
        "name": "Constant_160",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "204"
        ],
        "name": "Constant_161",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "202",
          "203",
          "204"
        ],
        "output": [
          "205"
        ],
        "name": "QuantizeLinear_162",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "206"
        ],
        "name": "Constant_163",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "207"
        ],
        "name": "Constant_164",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "205",
          "206",
          "207"
        ],
        "output": [
          "208"
        ],
        "name": "DequantizeLinear_165",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "209"
        ],
        "name": "Constant_166",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "210"
        ],
        "name": "Constant_167",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_17.weight",
          "209",
          "210"
        ],
        "output": [
          "211"
        ],
        "name": "QuantizeLinear_168",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "212"
        ],
        "name": "Constant_169",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "213"
        ],
        "name": "Constant_170",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "211",
          "212",
          "213"
        ],
        "output": [
          "214"
        ],
        "name": "DequantizeLinear_171",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "215"
        ],
        "name": "Constant_172",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "216"
        ],
        "name": "Constant_173",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_17.bias",
          "215",
          "216"
        ],
        "output": [
          "217"
        ],
        "name": "QuantizeLinear_174",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "218"
        ],
        "name": "Constant_175",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "219"
        ],
        "name": "Constant_176",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "217",
          "218",
          "219"
        ],
        "output": [
          "220"
        ],
        "name": "DequantizeLinear_177",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "169",
          "214",
          "220"
        ],
        "output": [
          "221"
        ],
        "name": "Conv_178",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
