{
  "irVersion": "7",
  "producerName": "pytorch",
  "producerVersion": "1.10",
  "graph": {
    "node": [
      {
        "output": [
          "115"
        ],
        "name": "Constant_0",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "116"
        ],
        "name": "Constant_1",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "res.1",
          "115",
          "116"
        ],
        "output": [
          "117"
        ],
        "name": "QuantizeLinear_2",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "118"
        ],
        "name": "Constant_3",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "119"
        ],
        "name": "Constant_4",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "117",
          "118",
          "119"
        ],
        "output": [
          "120"
        ],
        "name": "DequantizeLinear_5",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "121"
        ],
        "name": "Constant_6",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "122"
        ],
        "name": "Constant_7",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_17.weight",
          "121",
          "122"
        ],
        "output": [
          "123"
        ],
        "name": "QuantizeLinear_8",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "124"
        ],
        "name": "Constant_9",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "125"
        ],
        "name": "Constant_10",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "123",
          "124",
          "125"
        ],
        "output": [
          "126"
        ],
        "name": "DequantizeLinear_11",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "127"
        ],
        "name": "Constant_12",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "128"
        ],
        "name": "Constant_13",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_17.bias",
          "127",
          "128"
        ],
        "output": [
          "129"
        ],
        "name": "QuantizeLinear_14",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "130"
        ],
        "name": "Constant_15",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "131"
        ],
        "name": "Constant_16",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "129",
          "130",
          "131"
        ],
        "output": [
          "132"
        ],
        "name": "DequantizeLinear_17",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "120",
          "126",
          "132"
        ],
        "output": [
          "133"
        ],
        "name": "Conv_18",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "133"
        ],
        "output": [
          "134"
        ],
        "name": "Relu_19",
        "opType": "Relu"
      },
      {
        "output": [
          "135"
        ],
        "name": "Constant_20",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "136"
        ],
        "name": "Constant_21",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "134",
          "135",
          "136"
        ],
        "output": [
          "137"
        ],
        "name": "QuantizeLinear_22",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "138"
        ],
        "name": "Constant_23",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "139"
        ],
        "name": "Constant_24",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "137",
          "138",
          "139"
        ],
        "output": [
          "140"
        ],
        "name": "DequantizeLinear_25",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "140"
        ],
        "output": [
          "141"
        ],
        "name": "MaxPool_26",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "142"
        ],
        "name": "Constant_27",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "143"
        ],
        "name": "Constant_28",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "141",
          "142",
          "143"
        ],
        "output": [
          "144"
        ],
        "name": "QuantizeLinear_29",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "145"
        ],
        "name": "Constant_30",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "146"
        ],
        "name": "Constant_31",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "144",
          "145",
          "146"
        ],
        "output": [
          "147"
        ],
        "name": "DequantizeLinear_32",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "148"
        ],
        "name": "Constant_33",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "149"
        ],
        "name": "Constant_34",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_20.weight",
          "148",
          "149"
        ],
        "output": [
          "150"
        ],
        "name": "QuantizeLinear_35",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "151"
        ],
        "name": "Constant_36",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "152"
        ],
        "name": "Constant_37",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "150",
          "151",
          "152"
        ],
        "output": [
          "153"
        ],
        "name": "DequantizeLinear_38",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "154"
        ],
        "name": "Constant_39",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "155"
        ],
        "name": "Constant_40",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_20.bias",
          "154",
          "155"
        ],
        "output": [
          "156"
        ],
        "name": "QuantizeLinear_41",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "157"
        ],
        "name": "Constant_42",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "158"
        ],
        "name": "Constant_43",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "156",
          "157",
          "158"
        ],
        "output": [
          "159"
        ],
        "name": "DequantizeLinear_44",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "147",
          "153",
          "159"
        ],
        "output": [
          "160"
        ],
        "name": "Conv_45",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "24",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "161"
        ],
        "name": "Constant_46",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "162"
        ],
        "name": "Constant_47",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "160",
          "161",
          "162"
        ],
        "output": [
          "163"
        ],
        "name": "QuantizeLinear_48",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "164"
        ],
        "name": "Constant_49",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "165"
        ],
        "name": "Constant_50",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "163",
          "164",
          "165"
        ],
        "output": [
          "166"
        ],
        "name": "DequantizeLinear_51",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "167"
        ],
        "name": "Constant_52",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "168"
        ],
        "name": "Constant_53",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_21.weight",
          "167",
          "168"
        ],
        "output": [
          "169"
        ],
        "name": "QuantizeLinear_54",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "170"
        ],
        "name": "Constant_55",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "171"
        ],
        "name": "Constant_56",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "169",
          "170",
          "171"
        ],
        "output": [
          "172"
        ],
        "name": "DequantizeLinear_57",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "173"
        ],
        "name": "Constant_58",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "174"
        ],
        "name": "Constant_59",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_21.bias",
          "173",
          "174"
        ],
        "output": [
          "175"
        ],
        "name": "QuantizeLinear_60",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "176"
        ],
        "name": "Constant_61",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "177"
        ],
        "name": "Constant_62",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "175",
          "176",
          "177"
        ],
        "output": [
          "178"
        ],
        "name": "DequantizeLinear_63",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "166",
          "172",
          "178"
        ],
        "output": [
          "179"
        ],
        "name": "Conv_64",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "179"
        ],
        "output": [
          "180"
        ],
        "name": "Relu_65",
        "opType": "Relu"
      },
      {
        "output": [
          "181"
        ],
        "name": "Constant_66",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "182"
        ],
        "name": "Constant_67",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_23.weight",
          "181",
          "182"
        ],
        "output": [
          "183"
        ],
        "name": "QuantizeLinear_68",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "184"
        ],
        "name": "Constant_69",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "185"
        ],
        "name": "Constant_70",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "183",
          "184",
          "185"
        ],
        "output": [
          "186"
        ],
        "name": "DequantizeLinear_71",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "187"
        ],
        "name": "Constant_72",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "188"
        ],
        "name": "Constant_73",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_23.bias",
          "187",
          "188"
        ],
        "output": [
          "189"
        ],
        "name": "QuantizeLinear_74",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "190"
        ],
        "name": "Constant_75",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "191"
        ],
        "name": "Constant_76",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "189",
          "190",
          "191"
        ],
        "output": [
          "192"
        ],
        "name": "DequantizeLinear_77",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "147",
          "186",
          "192"
        ],
        "output": [
          "193"
        ],
        "name": "Conv_78",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "193"
        ],
        "output": [
          "194"
        ],
        "name": "Relu_79",
        "opType": "Relu"
      },
      {
        "output": [
          "195"
        ],
        "name": "Constant_80",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "196"
        ],
        "name": "Constant_81",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "194",
          "195",
          "196"
        ],
        "output": [
          "197"
        ],
        "name": "QuantizeLinear_82",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "198"
        ],
        "name": "Constant_83",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "199"
        ],
        "name": "Constant_84",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "197",
          "198",
          "199"
        ],
        "output": [
          "200"
        ],
        "name": "DequantizeLinear_85",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "201"
        ],
        "name": "Constant_86",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "202"
        ],
        "name": "Constant_87",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_25.weight",
          "201",
          "202"
        ],
        "output": [
          "203"
        ],
        "name": "QuantizeLinear_88",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "204"
        ],
        "name": "Constant_89",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "205"
        ],
        "name": "Constant_90",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "203",
          "204",
          "205"
        ],
        "output": [
          "206"
        ],
        "name": "DequantizeLinear_91",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "207"
        ],
        "name": "Constant_92",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "208"
        ],
        "name": "Constant_93",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_25.bias",
          "207",
          "208"
        ],
        "output": [
          "209"
        ],
        "name": "QuantizeLinear_94",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "210"
        ],
        "name": "Constant_95",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "211"
        ],
        "name": "Constant_96",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "209",
          "210",
          "211"
        ],
        "output": [
          "212"
        ],
        "name": "DequantizeLinear_97",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "200",
          "206",
          "212"
        ],
        "output": [
          "213"
        ],
        "name": "Conv_98",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "24",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "214"
        ],
        "name": "Constant_99",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "215"
        ],
        "name": "Constant_100",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "213",
          "214",
          "215"
        ],
        "output": [
          "216"
        ],
        "name": "QuantizeLinear_101",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "217"
        ],
        "name": "Constant_102",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "218"
        ],
        "name": "Constant_103",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "216",
          "217",
          "218"
        ],
        "output": [
          "219"
        ],
        "name": "DequantizeLinear_104",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "220"
        ],
        "name": "Constant_105",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "221"
        ],
        "name": "Constant_106",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_26.weight",
          "220",
          "221"
        ],
        "output": [
          "222"
        ],
        "name": "QuantizeLinear_107",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "223"
        ],
        "name": "Constant_108",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "224"
        ],
        "name": "Constant_109",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "222",
          "223",
          "224"
        ],
        "output": [
          "225"
        ],
        "name": "DequantizeLinear_110",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "226"
        ],
        "name": "Constant_111",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "227"
        ],
        "name": "Constant_112",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_26.bias",
          "226",
          "227"
        ],
        "output": [
          "228"
        ],
        "name": "QuantizeLinear_113",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "229"
        ],
        "name": "Constant_114",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "230"
        ],
        "name": "Constant_115",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "228",
          "229",
          "230"
        ],
        "output": [
          "231"
        ],
        "name": "DequantizeLinear_116",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "219",
          "225",
          "231"
        ],
        "output": [
          "232"
        ],
        "name": "Conv_117",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "232"
        ],
        "output": [
          "233"
        ],
        "name": "Relu_118",
        "opType": "Relu"
      },
      {
        "input": [
          "180",
          "233"
        ],
        "output": [
          "234"
        ],
        "name": "Concat_119",
        "opType": "Concat",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "235"
        ],
        "name": "Constant_120",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "236"
        ],
        "name": "Constant_121",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "234",
          "235",
          "236"
        ],
        "output": [
          "237"
        ],
        "name": "QuantizeLinear_122",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "238"
        ],
        "name": "Constant_123",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "239"
        ],
        "name": "Constant_124",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "237",
          "238",
          "239"
        ],
        "output": [
          "240"
        ],
        "name": "DequantizeLinear_125",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "240",
          "2000"
        ],
        "output": [
          "257"
        ],
        "name": "Reshape_126",
        "opType": "Reshape"
      },
      {
        "input": [
          "257"
        ],
        "output": [
          "258"
        ],
        "name": "Transpose_127",
        "opType": "Transpose",
        "attribute": [
          {
            "name": "perm",
            "ints": [
              "0",
              "2",
              "1",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "259"
        ],
        "name": "Constant_128",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "260"
        ],
        "name": "Constant_129",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "258",
          "259",
          "260"
        ],
        "output": [
          "261"
        ],
        "name": "QuantizeLinear_130",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "262"
        ],
        "name": "Constant_131",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "263"
        ],
        "name": "Constant_132",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "261",
          "262",
          "263"
        ],
        "output": [
          "264"
        ],
        "name": "DequantizeLinear_133",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "264",
          "2005"
        ],
        "output": [
          "275"
        ],
        "name": "Reshape_134",
        "opType": "Reshape"
      },
      {
        "input": [
          "275"
        ],
        "output": [
          "276"
        ],
        "name": "Shape_135",
        "opType": "Shape"
      },
      {
        "output": [
          "277"
        ],
        "name": "Constant_136",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "276",
          "277"
        ],
        "output": [
          "278"
        ],
        "name": "Gather_137",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "279"
        ],
        "name": "Constant_138",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "280"
        ],
        "name": "Constant_139",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "278",
          "280"
        ],
        "output": [
          "281"
        ],
        "name": "Add_140",
        "opType": "Add"
      },
      {
        "output": [
          "282"
        ],
        "name": "Constant_141",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "281",
          "282"
        ],
        "output": [
          "283"
        ],
        "name": "Div_142",
        "opType": "Div"
      },
      {
        "output": [
          "284"
        ],
        "name": "Constant_143",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "283",
          "284"
        ],
        "output": [
          "285"
        ],
        "name": "Mul_144",
        "opType": "Mul"
      },
      {
        "input": [
          "275",
          "279",
          "285",
          "277"
        ],
        "output": [
          "286"
        ],
        "name": "Slice_145",
        "opType": "Slice"
      },
      {
        "output": [
          "287"
        ],
        "name": "Constant_146",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "283",
          "287"
        ],
        "output": [
          "288"
        ],
        "name": "Mul_147",
        "opType": "Mul"
      },
      {
        "input": [
          "275",
          "285",
          "288",
          "277"
        ],
        "output": [
          "289"
        ],
        "name": "Slice_148",
        "opType": "Slice"
      },
      {
        "output": [
          "290"
        ],
        "name": "Constant_149",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "291"
        ],
        "name": "Constant_150",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_40.weight",
          "290",
          "291"
        ],
        "output": [
          "292"
        ],
        "name": "QuantizeLinear_151",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "293"
        ],
        "name": "Constant_152",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "294"
        ],
        "name": "Constant_153",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "292",
          "293",
          "294"
        ],
        "output": [
          "295"
        ],
        "name": "DequantizeLinear_154",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "296"
        ],
        "name": "Constant_155",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "297"
        ],
        "name": "Constant_156",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_40.bias",
          "296",
          "297"
        ],
        "output": [
          "298"
        ],
        "name": "QuantizeLinear_157",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "299"
        ],
        "name": "Constant_158",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "300"
        ],
        "name": "Constant_159",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "298",
          "299",
          "300"
        ],
        "output": [
          "301"
        ],
        "name": "DequantizeLinear_160",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "289",
          "295",
          "301"
        ],
        "output": [
          "302"
        ],
        "name": "Conv_161",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "302"
        ],
        "output": [
          "303"
        ],
        "name": "Relu_162",
        "opType": "Relu"
      },
      {
        "output": [
          "304"
        ],
        "name": "Constant_163",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "305"
        ],
        "name": "Constant_164",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "303",
          "304",
          "305"
        ],
        "output": [
          "306"
        ],
        "name": "QuantizeLinear_165",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "307"
        ],
        "name": "Constant_166",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "308"
        ],
        "name": "Constant_167",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "306",
          "307",
          "308"
        ],
        "output": [
          "309"
        ],
        "name": "DequantizeLinear_168",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "310"
        ],
        "name": "Constant_169",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "311"
        ],
        "name": "Constant_170",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_42.weight",
          "310",
          "311"
        ],
        "output": [
          "312"
        ],
        "name": "QuantizeLinear_171",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "313"
        ],
        "name": "Constant_172",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "314"
        ],
        "name": "Constant_173",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "312",
          "313",
          "314"
        ],
        "output": [
          "315"
        ],
        "name": "DequantizeLinear_174",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "316"
        ],
        "name": "Constant_175",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "317"
        ],
        "name": "Constant_176",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_42.bias",
          "316",
          "317"
        ],
        "output": [
          "318"
        ],
        "name": "QuantizeLinear_177",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "319"
        ],
