{
  "irVersion": "7",
  "producerName": "pytorch",
  "producerVersion": "1.10",
  "graph": {
    "node": [
      {
        "output": [
          "53"
        ],
        "name": "Constant_0",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "54"
        ],
        "name": "Constant_1",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "res.1",
          "53",
          "54"
        ],
        "output": [
          "55"
        ],
        "name": "QuantizeLinear_2",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "56"
        ],
        "name": "Constant_3",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "57"
        ],
        "name": "Constant_4",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "55",
          "56",
          "57"
        ],
        "output": [
          "58"
        ],
        "name": "DequantizeLinear_5",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "59"
        ],
        "name": "Constant_6",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "60"
        ],
        "name": "Constant_7",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.weight",
          "59",
          "60"
        ],
        "output": [
          "61"
        ],
        "name": "QuantizeLinear_8",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "62"
        ],
        "name": "Constant_9",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "63"
        ],
        "name": "Constant_10",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "61",
          "62",
          "63"
        ],
        "output": [
          "64"
        ],
        "name": "DequantizeLinear_11",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "65"
        ],
        "name": "Constant_12",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "66"
        ],
        "name": "Constant_13",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.bias",
          "65",
          "66"
        ],
        "output": [
          "67"
        ],
        "name": "QuantizeLinear_14",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "68"
        ],
        "name": "Constant_15",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "69"
        ],
        "name": "Constant_16",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "67",
          "68",
          "69"
        ],
        "output": [
          "70"
        ],
        "name": "DequantizeLinear_17",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "58",
          "64",
          "70"
        ],
        "output": [
          "71"
        ],
        "name": "Conv_18",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "7",
              "7"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "71"
        ],
        "output": [
          "72"
        ],
        "name": "Relu_19",
        "opType": "Relu"
      },
      {
        "output": [
          "73"
        ],
        "name": "Constant_20",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "74"
        ],
        "name": "Constant_21",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "72",
          "73",
          "74"
        ],
        "output": [
          "75"
        ],
        "name": "QuantizeLinear_22",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "76"
        ],
        "name": "Constant_23",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "77"
        ],
        "name": "Constant_24",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "75",
          "76",
          "77"
        ],
        "output": [
          "78"
        ],
        "name": "DequantizeLinear_25",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "78"
        ],
        "output": [
          "79"
        ],
        "name": "MaxPool_26",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "80"
        ],
        "name": "Constant_27",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "81"
        ],
        "name": "Constant_28",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "79",
          "80",
          "81"
        ],
        "output": [
          "82"
        ],
        "name": "QuantizeLinear_29",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "83"
        ],
        "name": "Constant_30",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "84"
        ],
        "name": "Constant_31",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "82",
          "83",
          "84"
        ],
        "output": [
          "85"
        ],
        "name": "DequantizeLinear_32",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "86"
        ],
        "name": "Constant_33",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "87"
        ],
        "name": "Constant_34",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_4.weight",
          "86",
          "87"
        ],
        "output": [
          "88"
        ],
        "name": "QuantizeLinear_35",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "89"
        ],
        "name": "Constant_36",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "90"
        ],
        "name": "Constant_37",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "88",
          "89",
          "90"
        ],
        "output": [
          "91"
        ],
        "name": "DequantizeLinear_38",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "92"
        ],
        "name": "Constant_39",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "93"
        ],
        "name": "Constant_40",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_4.bias",
          "92",
          "93"
        ],
        "output": [
          "94"
        ],
        "name": "QuantizeLinear_41",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "95"
        ],
        "name": "Constant_42",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "96"
        ],
        "name": "Constant_43",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "94",
          "95",
          "96"
        ],
        "output": [
          "97"
        ],
        "name": "DequantizeLinear_44",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "85",
          "91",
          "97"
        ],
        "output": [
          "98"
        ],
        "name": "Conv_45",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "98"
        ],
        "output": [
          "99"
        ],
        "name": "Relu_46",
        "opType": "Relu"
      },
      {
        "output": [
          "100"
        ],
        "name": "Constant_47",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "101"
        ],
        "name": "Constant_48",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "99",
          "100",
          "101"
        ],
        "output": [
          "102"
        ],
        "name": "QuantizeLinear_49",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "103"
        ],
        "name": "Constant_50",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "104"
        ],
        "name": "Constant_51",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "102",
          "103",
          "104"
        ],
        "output": [
          "105"
        ],
        "name": "DequantizeLinear_52",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "106"
        ],
        "name": "Constant_53",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "107"
        ],
        "name": "Constant_54",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_6.weight",
          "106",
          "107"
        ],
        "output": [
          "108"
        ],
        "name": "QuantizeLinear_55",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "109"
        ],
        "name": "Constant_56",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "110"
        ],
        "name": "Constant_57",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "108",
          "109",
          "110"
        ],
        "output": [
          "111"
        ],
        "name": "DequantizeLinear_58",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "112"
        ],
        "name": "Constant_59",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "113"
        ],
        "name": "Constant_60",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_6.bias",
          "112",
          "113"
        ],
        "output": [
          "114"
        ],
        "name": "QuantizeLinear_61",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "115"
        ],
        "name": "Constant_62",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "116"
        ],
        "name": "Constant_63",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "114",
          "115",
          "116"
        ],
        "output": [
          "117"
        ],
        "name": "DequantizeLinear_64",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "105",
          "111",
          "117"
        ],
        "output": [
          "118"
        ],
        "name": "Conv_65",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "118"
        ],
        "output": [
          "119"
        ],
        "name": "Relu_66",
        "opType": "Relu"
      },
      {
        "output": [
          "120"
        ],
        "name": "Constant_67",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "121"
        ],
        "name": "Constant_68",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_8.weight",
          "120",
          "121"
        ],
        "output": [
          "122"
        ],
        "name": "QuantizeLinear_69",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "123"
        ],
        "name": "Constant_70",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "124"
        ],
        "name": "Constant_71",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "122",
          "123",
          "124"
        ],
        "output": [
          "125"
        ],
        "name": "DequantizeLinear_72",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "126"
        ],
        "name": "Constant_73",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "127"
        ],
        "name": "Constant_74",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_8.bias",
          "126",
          "127"
        ],
        "output": [
          "128"
        ],
        "name": "QuantizeLinear_75",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "129"
        ],
        "name": "Constant_76",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "130"
        ],
        "name": "Constant_77",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "128",
          "129",
          "130"
        ],
        "output": [
          "131"
        ],
        "name": "DequantizeLinear_78",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "105",
          "125",
          "131"
        ],
        "output": [
          "132"
        ],
        "name": "Conv_79",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "132"
        ],
        "output": [
          "133"
        ],
        "name": "Relu_80",
        "opType": "Relu"
      },
      {
        "input": [
          "119",
          "133"
        ],
        "output": [
          "134"
        ],
        "name": "Concat_81",
        "opType": "Concat",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "135"
        ],
        "name": "Constant_82",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "136"
        ],
        "name": "Constant_83",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "134",
          "135",
          "136"
        ],
        "output": [
          "137"
        ],
        "name": "QuantizeLinear_84",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "138"
        ],
        "name": "Constant_85",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "139"
        ],
        "name": "Constant_86",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "137",
          "138",
          "139"
        ],
        "output": [
          "140"
        ],
        "name": "DequantizeLinear_87",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "141"
        ],
        "name": "Constant_88",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "142"
        ],
        "name": "Constant_89",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_11.weight",
          "141",
          "142"
        ],
        "output": [
          "143"
        ],
        "name": "QuantizeLinear_90",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "144"
        ],
        "name": "Constant_91",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "145"
        ],
        "name": "Constant_92",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "143",
          "144",
          "145"
        ],
        "output": [
          "146"
        ],
        "name": "DequantizeLinear_93",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "147"
        ],
        "name": "Constant_94",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "148"
        ],
        "name": "Constant_95",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_11.bias",
          "147",
          "148"
        ],
        "output": [
          "149"
        ],
        "name": "QuantizeLinear_96",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "150"
        ],
        "name": "Constant_97",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "151"
        ],
        "name": "Constant_98",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "149",
          "150",
          "151"
        ],
        "output": [
          "152"
        ],
        "name": "DequantizeLinear_99",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "140",
          "146",
          "152"
        ],
        "output": [
          "153"
        ],
        "name": "Conv_100",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "153"
        ],
        "output": [
          "154"
        ],
        "name": "Relu_101",
        "opType": "Relu"
      },
      {
        "output": [
          "155"
        ],
        "name": "Constant_102",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "156"
        ],
        "name": "Constant_103",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "154",
          "155",
          "156"
        ],
        "output": [
          "157"
        ],
        "name": "QuantizeLinear_104",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "158"
        ],
        "name": "Constant_105",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "159"
        ],
        "name": "Constant_106",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "157",
          "158",
          "159"
        ],
        "output": [
          "160"
        ],
        "name": "DequantizeLinear_107",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "161"
        ],
        "name": "Constant_108",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "162"
        ],
        "name": "Constant_109",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_13.weight",
          "161",
          "162"
        ],
        "output": [
          "163"
        ],
        "name": "QuantizeLinear_110",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "164"
        ],
        "name": "Constant_111",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "165"
        ],
        "name": "Constant_112",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "163",
          "164",
          "165"
        ],
        "output": [
          "166"
        ],
        "name": "DequantizeLinear_113",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "167"
        ],
        "name": "Constant_114",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "168"
        ],
        "name": "Constant_115",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_13.bias",
          "167",
          "168"
        ],
        "output": [
          "169"
        ],
        "name": "QuantizeLinear_116",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "170"
        ],
        "name": "Constant_117",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "171"
        ],
        "name": "Constant_118",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "169",
          "170",
          "171"
        ],
        "output": [
          "172"
        ],
        "name": "DequantizeLinear_119",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "160",
          "166",
          "172"
        ],
        "output": [
          "173"
        ],
        "name": "Conv_120",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "173"
        ],
        "output": [
          "174"
        ],
        "name": "Relu_121",
        "opType": "Relu"
      },
      {
        "output": [
          "175"
        ],
        "name": "Constant_122",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "176"
        ],
        "name": "Constant_123",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_15.weight",
          "175",
          "176"
        ],
        "output": [
          "177"
        ],
        "name": "QuantizeLinear_124",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "178"
        ],
        "name": "Constant_125",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "179"
        ],
        "name": "Constant_126",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "177",
          "178",
          "179"
        ],
        "output": [
          "180"
        ],
        "name": "DequantizeLinear_127",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "181"
        ],
        "name": "Constant_128",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "182"
        ],
        "name": "Constant_129",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_15.bias",
          "181",
          "182"
        ],
        "output": [
          "183"
        ],
        "name": "QuantizeLinear_130",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "184"
        ],
        "name": "Constant_131",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "185"
        ],
        "name": "Constant_132",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "183",
          "184",
          "185"
        ],
        "output": [
          "186"
        ],
        "name": "DequantizeLinear_133",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "160",
          "180",
          "186"
        ],
        "output": [
          "187"
        ],
        "name": "Conv_134",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "187"
        ],
        "output": [
          "188"
        ],
        "name": "Relu_135",
        "opType": "Relu"
      },
      {
        "input": [
          "174",
          "188"
        ],
        "output": [
          "189"
        ],
        "name": "Concat_136",
        "opType": "Concat",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "190"
        ],
        "name": "Constant_137",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "191"
        ],
        "name": "Constant_138",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "189",
          "190",
          "191"
        ],
        "output": [
          "192"
        ],
        "name": "QuantizeLinear_139",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "193"
        ],
        "name": "Constant_140",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "194"
        ],
        "name": "Constant_141",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "192",
          "193",
          "194"
        ],
        "output": [
          "195"
        ],
        "name": "DequantizeLinear_142",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "196"
        ],
        "name": "Constant_143",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "197"
        ],
        "name": "Constant_144",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_18.weight",
          "196",
          "197"
        ],
        "output": [
          "198"
        ],
        "name": "QuantizeLinear_145",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "199"
        ],
        "name": "Constant_146",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "200"
        ],
        "name": "Constant_147",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "198",
          "199",
          "200"
        ],
        "output": [
          "201"
        ],
        "name": "DequantizeLinear_148",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "202"
        ],
        "name": "Constant_149",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "203"
        ],
        "name": "Constant_150",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_18.bias",
          "202",
          "203"
        ],
        "output": [
          "204"
        ],
        "name": "QuantizeLinear_151",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "205"
        ],
        "name": "Constant_152",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "206"
        ],
        "name": "Constant_153",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "204",
          "205",
          "206"
        ],
        "output": [
          "207"
        ],
        "name": "DequantizeLinear_154",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "195",
          "201",
          "207"
        ],
        "output": [
          "208"
        ],
        "name": "Conv_155",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "208"
        ],
        "output": [
          "209"
        ],
        "name": "Relu_156",
        "opType": "Relu"
      },
      {
        "output": [
          "210"
        ],
        "name": "Constant_157",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "211"
        ],
        "name": "Constant_158",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "209",
          "210",
          "211"
        ],
        "output": [
          "212"
        ],
        "name": "QuantizeLinear_159",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "213"
        ],
        "name": "Constant_160",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "214"
        ],
        "name": "Constant_161",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "212",
          "213",
          "214"
        ],
        "output": [
          "215"
        ],
        "name": "DequantizeLinear_162",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "216"
        ],
        "name": "Constant_163",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "217"
        ],
        "name": "Constant_164",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_20.weight",
          "216",
          "217"
        ],
        "output": [
          "218"
        ],
        "name": "QuantizeLinear_165",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "219"
        ],
        "name": "Constant_166",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "220"
        ],
        "name": "Constant_167",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "218",
          "219",
          "220"
        ],
        "output": [
          "221"
        ],
        "name": "DequantizeLinear_168",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "222"
        ],
        "name": "Constant_169",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "223"
        ],
        "name": "Constant_170",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_20.bias",
          "222",
          "223"
        ],
        "output": [
          "224"
        ],
        "name": "QuantizeLinear_171",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "225"
        ],
        "name": "Constant_172",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "226"
        ],
        "name": "Constant_173",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "224",
          "225",
          "226"
        ],
        "output": [
          "227"
        ],
        "name": "DequantizeLinear_174",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "215",
          "221",
          "227"
        ],
