{
  "irVersion": "7",
  "producerName": "pytorch",
  "producerVersion": "1.10",
  "graph": {
    "node": [
      {
        "output": [
          "23"
        ],
        "name": "Constant_0",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "24"
        ],
        "name": "Constant_1",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "res.1",
          "23",
          "24"
        ],
        "output": [
          "25"
        ],
        "name": "QuantizeLinear_2",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "26"
        ],
        "name": "Constant_3",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "27"
        ],
        "name": "Constant_4",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "25",
          "26",
          "27"
        ],
        "output": [
          "28"
        ],
        "name": "DequantizeLinear_5",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "29"
        ],
        "name": "Constant_6",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "30"
        ],
        "name": "Constant_7",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.weight",
          "29",
          "30"
        ],
        "output": [
          "31"
        ],
        "name": "QuantizeLinear_8",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "32"
        ],
        "name": "Constant_9",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "33"
        ],
        "name": "Constant_10",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "31",
          "32",
          "33"
        ],
        "output": [
          "34"
        ],
        "name": "DequantizeLinear_11",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "35"
        ],
        "name": "Constant_12",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "36"
        ],
        "name": "Constant_13",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_1.bias",
          "35",
          "36"
        ],
        "output": [
          "37"
        ],
        "name": "QuantizeLinear_14",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "38"
        ],
        "name": "Constant_15",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "39"
        ],
        "name": "Constant_16",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "37",
          "38",
          "39"
        ],
        "output": [
          "40"
        ],
        "name": "DequantizeLinear_17",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "28",
          "34",
          "40"
        ],
        "output": [
          "41"
        ],
        "name": "Conv_18",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "41"
        ],
        "output": [
          "42"
        ],
        "name": "Relu_19",
        "opType": "Relu"
      },
      {
        "output": [
          "43"
        ],
        "name": "Constant_20",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "44"
        ],
        "name": "Constant_21",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "42",
          "43",
          "44"
        ],
        "output": [
          "45"
        ],
        "name": "QuantizeLinear_22",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "46"
        ],
        "name": "Constant_23",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "47"
        ],
        "name": "Constant_24",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "45",
          "46",
          "47"
        ],
        "output": [
          "48"
        ],
        "name": "DequantizeLinear_25",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "48"
        ],
        "output": [
          "49"
        ],
        "name": "MaxPool_26",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "50"
        ],
        "name": "Constant_27",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "51"
        ],
        "name": "Constant_28",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "49",
          "50",
          "51"
        ],
        "output": [
          "52"
        ],
        "name": "QuantizeLinear_29",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "53"
        ],
        "name": "Constant_30",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "54"
        ],
        "name": "Constant_31",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "52",
          "53",
          "54"
        ],
        "output": [
          "55"
        ],
        "name": "DequantizeLinear_32",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "56"
        ],
        "name": "Constant_33",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "57"
        ],
        "name": "Constant_34",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_4.weight",
          "56",
          "57"
        ],
        "output": [
          "58"
        ],
        "name": "QuantizeLinear_35",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "59"
        ],
        "name": "Constant_36",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "60"
        ],
        "name": "Constant_37",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "58",
          "59",
          "60"
        ],
        "output": [
          "61"
        ],
        "name": "DequantizeLinear_38",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "62"
        ],
        "name": "Constant_39",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "63"
        ],
        "name": "Constant_40",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_4.bias",
          "62",
          "63"
        ],
        "output": [
          "64"
        ],
        "name": "QuantizeLinear_41",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "65"
        ],
        "name": "Constant_42",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "66"
        ],
        "name": "Constant_43",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "64",
          "65",
          "66"
        ],
        "output": [
          "67"
        ],
        "name": "DequantizeLinear_44",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "55",
          "61",
          "67"
        ],
        "output": [
          "68"
        ],
        "name": "Conv_45",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "68"
        ],
        "output": [
          "69"
        ],
        "name": "Relu_46",
        "opType": "Relu"
      },
      {
        "output": [
          "70"
        ],
        "name": "Constant_47",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "71"
        ],
        "name": "Constant_48",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "69",
          "70",
          "71"
        ],
        "output": [
          "72"
        ],
        "name": "QuantizeLinear_49",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "73"
        ],
        "name": "Constant_50",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "74"
        ],
        "name": "Constant_51",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "72",
          "73",
          "74"
        ],
        "output": [
          "75"
        ],
        "name": "DequantizeLinear_52",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "75"
        ],
        "output": [
          "76"
        ],
        "name": "MaxPool_53",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "77"
        ],
        "name": "Constant_54",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "78"
        ],
        "name": "Constant_55",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "76",
          "77",
          "78"
        ],
        "output": [
          "79"
        ],
        "name": "QuantizeLinear_56",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "80"
        ],
        "name": "Constant_57",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "81"
        ],
        "name": "Constant_58",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "79",
          "80",
          "81"
        ],
        "output": [
          "82"
        ],
        "name": "DequantizeLinear_59",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "83"
        ],
        "name": "Constant_60",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "84"
        ],
        "name": "Constant_61",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_7.weight",
          "83",
          "84"
        ],
        "output": [
          "85"
        ],
        "name": "QuantizeLinear_62",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "86"
        ],
        "name": "Constant_63",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "87"
        ],
        "name": "Constant_64",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "85",
          "86",
          "87"
        ],
        "output": [
          "88"
        ],
        "name": "DequantizeLinear_65",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "89"
        ],
        "name": "Constant_66",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "90"
        ],
        "name": "Constant_67",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_7.bias",
          "89",
          "90"
        ],
        "output": [
          "91"
        ],
        "name": "QuantizeLinear_68",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "92"
        ],
        "name": "Constant_69",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "93"
        ],
        "name": "Constant_70",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "91",
          "92",
          "93"
        ],
        "output": [
          "94"
        ],
        "name": "DequantizeLinear_71",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "82",
          "88",
          "94"
        ],
        "output": [
          "95"
        ],
        "name": "Conv_72",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "95"
        ],
        "output": [
          "96"
        ],
        "name": "Relu_73",
        "opType": "Relu"
      },
      {
        "output": [
          "97"
        ],
        "name": "Constant_74",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "98"
        ],
        "name": "Constant_75",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "96",
          "97",
          "98"
        ],
        "output": [
          "99"
        ],
        "name": "QuantizeLinear_76",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "100"
        ],
        "name": "Constant_77",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "101"
        ],
        "name": "Constant_78",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "99",
          "100",
          "101"
        ],
        "output": [
          "102"
        ],
        "name": "DequantizeLinear_79",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "103"
        ],
        "name": "Constant_80",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "104"
        ],
        "name": "Constant_81",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_9.weight",
          "103",
          "104"
        ],
        "output": [
          "105"
        ],
        "name": "QuantizeLinear_82",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "106"
        ],
        "name": "Constant_83",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "107"
        ],
        "name": "Constant_84",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "105",
          "106",
          "107"
        ],
        "output": [
          "108"
        ],
        "name": "DequantizeLinear_85",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "109"
        ],
        "name": "Constant_86",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "110"
        ],
        "name": "Constant_87",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_9.bias",
          "109",
          "110"
        ],
        "output": [
          "111"
        ],
        "name": "QuantizeLinear_88",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "112"
        ],
        "name": "Constant_89",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "113"
        ],
        "name": "Constant_90",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "111",
          "112",
          "113"
        ],
        "output": [
          "114"
        ],
        "name": "DequantizeLinear_91",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "102",
          "108",
          "114"
        ],
        "output": [
          "115"
        ],
        "name": "Conv_92",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "115"
        ],
        "output": [
          "116"
        ],
        "name": "Relu_93",
        "opType": "Relu"
      },
      {
        "output": [
          "117"
        ],
        "name": "Constant_94",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "118"
        ],
        "name": "Constant_95",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "116",
          "117",
          "118"
        ],
        "output": [
          "119"
        ],
        "name": "QuantizeLinear_96",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "120"
        ],
        "name": "Constant_97",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "121"
        ],
        "name": "Constant_98",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "119",
          "120",
          "121"
        ],
        "output": [
          "122"
        ],
        "name": "DequantizeLinear_99",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "122"
        ],
        "output": [
          "123"
        ],
        "name": "MaxPool_100",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "124"
        ],
        "name": "Constant_101",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "125"
        ],
        "name": "Constant_102",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "123",
          "124",
          "125"
        ],
        "output": [
          "126"
        ],
        "name": "QuantizeLinear_103",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "127"
        ],
        "name": "Constant_104",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "128"
        ],
        "name": "Constant_105",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "126",
          "127",
          "128"
        ],
        "output": [
          "129"
        ],
        "name": "DequantizeLinear_106",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "130"
        ],
        "name": "Constant_107",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "131"
        ],
        "name": "Constant_108",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_12.weight",
          "130",
          "131"
        ],
        "output": [
          "132"
        ],
        "name": "QuantizeLinear_109",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "133"
        ],
        "name": "Constant_110",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "134"
        ],
        "name": "Constant_111",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "132",
          "133",
          "134"
        ],
        "output": [
          "135"
        ],
        "name": "DequantizeLinear_112",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "136"
        ],
        "name": "Constant_113",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "137"
        ],
        "name": "Constant_114",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_12.bias",
          "136",
          "137"
        ],
        "output": [
          "138"
        ],
        "name": "QuantizeLinear_115",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "139"
        ],
        "name": "Constant_116",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "140"
        ],
        "name": "Constant_117",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "138",
          "139",
          "140"
        ],
        "output": [
          "141"
        ],
        "name": "DequantizeLinear_118",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "129",
          "135",
          "141"
        ],
        "output": [
          "142"
        ],
        "name": "Conv_119",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "142"
        ],
        "output": [
          "143"
        ],
        "name": "Relu_120",
        "opType": "Relu"
      },
      {
        "output": [
          "144"
        ],
        "name": "Constant_121",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "145"
        ],
        "name": "Constant_122",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "143",
          "144",
          "145"
        ],
        "output": [
          "146"
        ],
        "name": "QuantizeLinear_123",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "147"
        ],
        "name": "Constant_124",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "148"
        ],
        "name": "Constant_125",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "146",
          "147",
          "148"
        ],
        "output": [
          "149"
        ],
        "name": "DequantizeLinear_126",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "150"
        ],
        "name": "Constant_127",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "151"
        ],
        "name": "Constant_128",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_14.weight",
          "150",
          "151"
        ],
        "output": [
          "152"
        ],
        "name": "QuantizeLinear_129",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "153"
        ],
        "name": "Constant_130",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "154"
        ],
        "name": "Constant_131",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "152",
          "153",
          "154"
        ],
        "output": [
          "155"
        ],
        "name": "DequantizeLinear_132",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "156"
        ],
        "name": "Constant_133",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "157"
        ],
        "name": "Constant_134",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_14.bias",
          "156",
          "157"
        ],
        "output": [
          "158"
        ],
        "name": "QuantizeLinear_135",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "159"
        ],
        "name": "Constant_136",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "160"
        ],
        "name": "Constant_137",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "158",
          "159",
          "160"
        ],
        "output": [
          "161"
        ],
        "name": "DequantizeLinear_138",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "149",
          "155",
          "161"
        ],
        "output": [
          "162"
        ],
        "name": "Conv_139",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "162"
        ],
        "output": [
          "163"
        ],
        "name": "Relu_140",
        "opType": "Relu"
      },
      {
        "output": [
          "164"
        ],
        "name": "Constant_141",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "165"
        ],
        "name": "Constant_142",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "163",
          "164",
          "165"
        ],
        "output": [
          "166"
        ],
        "name": "QuantizeLinear_143",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "167"
        ],
        "name": "Constant_144",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "168"
        ],
        "name": "Constant_145",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "166",
          "167",
          "168"
        ],
        "output": [
          "169"
        ],
        "name": "DequantizeLinear_146",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "169"
        ],
        "output": [
          "170"
        ],
        "name": "MaxPool_147",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "output": [
          "171"
        ],
        "name": "Constant_148",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "172"
        ],
        "name": "Constant_149",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "170",
          "171",
          "172"
        ],
        "output": [
          "173"
        ],
        "name": "QuantizeLinear_150",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "174"
        ],
        "name": "Constant_151",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "175"
        ],
        "name": "Constant_152",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "173",
          "174",
          "175"
        ],
        "output": [
          "176"
        ],
        "name": "DequantizeLinear_153",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "177"
        ],
        "name": "Constant_154",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "178"
        ],
        "name": "Constant_155",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_17.weight",
          "177",
          "178"
        ],
        "output": [
          "179"
        ],
        "name": "QuantizeLinear_156",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "180"
        ],
        "name": "Constant_157",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "181"
        ],
        "name": "Constant_158",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "179",
          "180",
          "181"
        ],
        "output": [
          "182"
        ],
        "name": "DequantizeLinear_159",
        "opType": "DequantizeLinear"
      },
      {
        "output": [
          "183"
        ],
        "name": "Constant_160",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "184"
        ],
        "name": "Constant_161",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "module_17.bias",
          "183",
          "184"
        ],
        "output": [
          "185"
        ],
        "name": "QuantizeLinear_162",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "186"
        ],
        "name": "Constant_163",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "187"
        ],
        "name": "Constant_164",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "185",
          "186",
          "187"
        ],
        "output": [
          "188"
        ],
        "name": "DequantizeLinear_165",
        "opType": "DequantizeLinear"
      },
      {
        "input": [
          "176",
          "182",
          "188"
        ],
        "output": [
          "189"
        ],
        "name": "Conv_166",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "189"
        ],
        "output": [
          "190"
        ],
        "name": "Relu_167",
        "opType": "Relu"
      },
      {
        "output": [
          "191"
        ],
        "name": "Constant_168",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "192"
        ],
        "name": "Constant_169",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "190",
          "191",
          "192"
        ],
        "output": [
          "193"
        ],
        "name": "QuantizeLinear_170",
        "opType": "QuantizeLinear"
      },
      {
        "output": [
          "194"
        ],
        "name": "Constant_171",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "type": "TENSOR"
          }
        ]
      },
